[
  {
    "name": "Inventory and Control of Enterprise Assets",
    "description": "This control ensures proper identification and inventory of organizational assets. It supports visibility and effective protection of systems and data.",
    "ref_code": "cis1",
    "system_level": false,
    "category": "Inventory and Control of Enterprise Assets",
    "subcategory": "Devices",
    "subcontrols": [
      {
        "name": "Establish and Maintain Detailed Enterprise Asset Inventory",
        "description": "Establish and maintain an accurate, detailed, and up-to-date inventory of all enterprise assets with the potential to store or process data, to include: end-user devices (including portable and mobile), network devices, non-computing/IoT devices, and servers. Ensure the inventory records the network address (if static), hardware address, machine name, enterprise asset owner, department for each asset, and whether the asset has been approved to connect to the network. For mobile end-user devices,MDM type tools can support this process, where appropriate. This inventory includes assetsconnected to the infrastructure physically, virtually, remotely, and those within cloud environments. Additionally, it includes assets that are regularly connected to the enterprise's network infrastructure, even if they are not under control of the enterprise. Review and update the inventory of all enterprise assets bi-annually, or more frequently.",
        "ref_code": "cis1.a",
        "guidance": "Establish and Maintain Detailed Enterprise Asset Inventory is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Address Unauthorized Assets",
        "description": "Ensure that a process exists to address unauthorized assets on a weekly basis. The enterprise may choose to remove the asset from the network, deny the asset from connecting remotely to the network, or quarantine the asset.",
        "ref_code": "cis1.b",
        "guidance": "Address Unauthorized Assets is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Utilize an Active Discovery Tool",
        "description": "Utilize an active discovery tool to identify assets connected to the enterprise's network. Configure the active discovery tool to execute daily, or more frequently.",
        "ref_code": "cis1.c",
        "guidance": "Utilize an Active Discovery Tool is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Use Dynamic Host Configuration Protocol (DHCP) Logging to Update Enterprise Asset Inventory",
        "description": "Use DHCP logging on all DHCP servers or Internet Protocol (IP) address management tools to update the enterprise's asset inventory. Review and use logs to update the enterprise's asset inventory weekly, or more frequently.",
        "ref_code": "cis1.d",
        "guidance": "Use Dynamic Host Configuration Protocol (DHCP) Logging to Update Enterprise Asset Inventory is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Use a Passive Asset Discovery Tool",
        "description": "Use a passive discovery tool to identify assets connected to the enterprise's network. Review and use scans to update the enterprise's asset inventory at least weekly, or more frequently.",
        "ref_code": "cis1.e",
        "guidance": "Use a Passive Asset Discovery Tool is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Inventory and Control of Software Assets",
    "description": "This control ensures proper identification and inventory of organizational assets. It supports visibility and effective protection of systems and data.",
    "ref_code": "cis2",
    "system_level": false,
    "category": "Inventory and Control of Software Assets",
    "subcategory": "Applications",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Software Inventory",
        "description": "Establish and maintain a detailed inventory of all licensed software installed on enterprise assets. The software inventory must document the title, publisher, initial install/use date, and business purpose for each entry; where appropriate, include the Uniform Resource Locator (URL), app store(s), version(s), deployment mechanism, and decommission date. Review and update the software inventory bi-annually, or more frequently.",
        "ref_code": "cis2.a",
        "guidance": "Establish and Maintain a Software Inventory is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Ensure Authorized Software is Currently Supported",
        "description": "Ensure that only currently supported software is designated as authorized in the software inventory for enterprise assets. If software is unsupported, yet necessary for the fulfillment of the enterprise's mission, document an exception detailing mitigating controls and residual risk acceptance. For any unsupported software without an exception documentation, designate as unauthorized. Review the software list to verify software support at least monthly, or more frequently.",
        "ref_code": "cis2.b",
        "guidance": "Ensure Authorized Software is Currently Supported is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Address Unauthorized Software",
        "description": "Ensure that unauthorized software is either removed from use on enterprise assets or receives a documented exception. Review monthly, or more frequently.",
        "ref_code": "cis2.c",
        "guidance": "Address Unauthorized Software is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Utilize Automated Software Inventory Tools",
        "description": "Utilize software inventory tools, when possible, throughout the enterprise to automate the discovery and documentation of installed software.",
        "ref_code": "cis2.d",
        "guidance": "Utilize Automated Software Inventory Tools is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Allowlist Authorized Software",
        "description": "Use technical controls, such as application allowlisting, to ensure that only authorized software can execute or be accessed. Reassess bi-annually, or more frequently.",
        "ref_code": "cis2.e",
        "guidance": "Allowlist Authorized Software is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Allowlist Authorized Libraries",
        "description": "Use technical controls to ensure that only authorized software libraries, such as specific .dll, .ocx, .so, etc., files, are allowed to load into a system process. Block unauthorized libraries from loading into a system process. Reassess bi-annually, or more frequently.",
        "ref_code": "cis2.f",
        "guidance": "Allowlist Authorized Libraries is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Allowlist Authorized Scripts",
        "description": "Use technical controls, such as digital signatures and version control, to ensure that only authorized scripts, such as specific .ps1, .py, etc., files, are allowed to execute. Block unauthorized scripts from executing. Reassess bi-annually, or more frequently.",
        "ref_code": "cis2.g",
        "guidance": "Allowlist Authorized Scripts is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Data Protection",
    "description": "This control focuses on securing sensitive data at rest and in transit. It helps prevent data loss and unauthorized disclosure.",
    "ref_code": "cis3",
    "system_level": false,
    "category": "Data Protection",
    "subcategory": "Data",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Data Management Process",
        "description": "Establish and maintain a data management process. In the process, address data sensitivity, data owner, handling of data, data retention limits, and disposal requirements, based on sensitivity and retention standards for the enterprise. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis3.a",
        "guidance": "Establish and Maintain a Data Management Process is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain a Data Inventory",
        "description": "Establish and maintain a data inventory, based on the enterprise's data management process. Inventory sensitive data, at a minimum. Review and update inventory annually, at a minimum, with a priority on sensitive data.",
        "ref_code": "cis3.b",
        "guidance": "Establish and Maintain a Data Inventory is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Configure Data Access Control Lists",
        "description": "Configure data access control lists based on a user's need to know. Apply data access control lists, also known as access permissions, to local and remote file systems, databases, and applications.",
        "ref_code": "cis3.c",
        "guidance": "Configure Data Access Control Lists is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Enforce Data Retention",
        "description": "Retain data according to the enterprise's data management process. Data retention must include both minimum and maximum timelines.",
        "ref_code": "cis3.d",
        "guidance": "Enforce Data Retention is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Securely Dispose of Data",
        "description": "Securely dispose of data as outlined in the enterprise's data management process. Ensure the disposal process and method are commensurate with the data sensitivity.",
        "ref_code": "cis3.e",
        "guidance": "Securely Dispose of Data is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Encrypt Data on End-User Devices",
        "description": "Encrypt data on end-user devices containing sensitive data. Example implementations can include: Windows BitLocker, Apple FileVault, Linux dm-crypt.",
        "ref_code": "cis3.f",
        "guidance": "Encrypt Data on End-User Devices is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain a Data Classification Scheme",
        "description": "Establish and maintain an overall data classification scheme for the enterprise. Enterprises may use labels, such as 'Sensitive,' 'Confidential,' and 'Public,' and classify their data according to those labels. Review and update the classification scheme annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis3.g",
        "guidance": "Establish and Maintain a Data Classification Scheme is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Document Data Flows",
        "description": "Document data flows. Data flow documentation includes service provider data flows and should be based on the enterprise's data management process. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis3.h",
        "guidance": "Document Data Flows is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Encrypt Data on Removable Media",
        "description": "Encrypt data on removable media.",
        "ref_code": "cis3.i",
        "guidance": "Encrypt Data on Removable Media is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Encrypt Sensitive Data in Transit",
        "description": "Encrypt sensitive data in transit. Example implementations can include: Transport Layer Security (TLS) and Open Secure Shell (OpenSSH).",
        "ref_code": "cis3.j",
        "guidance": "Encrypt Sensitive Data in Transit is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Encrypt Sensitive Data at Rest",
        "description": "Encrypt sensitive data at rest on servers, applications, and databases containing sensitive data. Storage-layer encryption, also known as server-side encryption, meets the minimum requirement of this Safeguard. Additional encryption methods may include application-layer encryption, also known as client-side encryption, where access to the data storage device(s) does not permit access to the plain-text data.",
        "ref_code": "cis3.k",
        "guidance": "Encrypt Sensitive Data at Rest is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Segment Data Processing and Storage Based on Sensitivity",
        "description": "Segment data processing and storage based on the sensitivity of the data. Do not process sensitive data on enterprise assets intended for lower sensitivity data.",
        "ref_code": "cis3.l",
        "guidance": "Segment Data Processing and Storage Based on Sensitivity is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Deploy a Data Loss Prevention Solution",
        "description": "Implement an automated tool, such as a host-based Data Loss Prevention (DLP) tool to identify all sensitive data stored, processed, or transmitted through enterprise assets, including those located onsite or at a remote service provider, and update the enterprise's sensitive data inventory.",
        "ref_code": "cis3.m",
        "guidance": "Deploy a Data Loss Prevention Solution is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Log Sensitive Data Access",
        "description": "Log sensitive data access, including modification and disposal.",
        "ref_code": "cis3.n",
        "guidance": "Log Sensitive Data Access is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      }
    ]
  },
  {
    "name": "Secure Configuration of Enterprise Assets and Software",
    "description": "This control ensures proper identification and inventory of organizational assets. It supports visibility and effective protection of systems and data.",
    "ref_code": "cis4",
    "system_level": false,
    "category": "Secure Configuration of Enterprise Assets and Software",
    "subcategory": "Devices",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Secure Configuration Process",
        "description": "Establish and maintain a secure configuration process for enterprise assets (end-user devices, including portable and mobile; non-computing/IoT devices; and servers) and software (operating systems and applications). Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis4.a",
        "guidance": "Establish and Maintain a Secure Configuration Process is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Establish and Maintain a Secure Configuration Process for Network Infrastructure",
        "description": "Establish and maintain a secure configuration process for network devices. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis4.b",
        "guidance": "Establish and Maintain a Secure Configuration Process for Network Infrastructure is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Configure Automatic Session Locking on Enterprise Assets",
        "description": "Configure automatic session locking on enterprise assets after a defined period of inactivity. For general purpose operating systems, the period must not exceed 15 minutes. For mobile end-user devices, the period must not exceed 2 minutes.",
        "ref_code": "cis4.c",
        "guidance": "Configure Automatic Session Locking on Enterprise Assets is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Implement and Manage a Firewall on Servers",
        "description": "Implement and manage a firewall on servers, where supported. Example implementations include a virtual firewall, operating system firewall, or a third-party firewall agent.",
        "ref_code": "cis4.d",
        "guidance": "Implement and Manage a Firewall on Servers is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Implement and Manage a Firewall on End-User Devices",
        "description": "Implement and manage a host-based firewall or port-filtering tool on end-user devices, with a default-deny rule that drops all traffic except those services and ports that are explicitly allowed.",
        "ref_code": "cis4.e",
        "guidance": "Implement and Manage a Firewall on End-User Devices is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Securely Manage Enterprise Assets and Software",
        "description": "Securely manage enterprise assets and software. Example implementations include managing configuration through version-controlled-infrastructure-as-code and accessing administrative interfaces over secure network protocols, such as Secure Shell (SSH) and Hypertext Transfer Protocol Secure (HTTPS). Do not use insecure management protocols, such as Telnet (Teletype Network) and HTTP, unless operationally essential.",
        "ref_code": "cis4.f",
        "guidance": "Securely Manage Enterprise Assets and Software is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Manage Default Accounts on Enterprise Assets and Software",
        "description": "Manage default accounts on enterprise assets and software, such as root, administrator, and other pre-configured vendor accounts. Example implementations can include: disabling default accounts or making them unusable.",
        "ref_code": "cis4.g",
        "guidance": "Manage Default Accounts on Enterprise Assets and Software is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Uninstall or Disable Unnecessary Services on Enterprise Assets and Software",
        "description": "Uninstall or disable unnecessary services on enterprise assets and software, such as an unused file sharing service, web application module, or service function.",
        "ref_code": "cis4.h",
        "guidance": "Uninstall or Disable Unnecessary Services on Enterprise Assets and Software is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Configure Trusted DNS Servers on Enterprise Assets",
        "description": "Configure trusted DNS servers on enterprise assets. Example implementations include: configuring assets to use enterprise-controlled DNS servers and/or reputable externally accessible DNS servers.",
        "ref_code": "cis4.i",
        "guidance": "Configure Trusted DNS Servers on Enterprise Assets is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Enforce Automatic Device Lockout on Portable End-User Devices",
        "description": "Enforce automatic device lockout following a predetermined threshold of local failed authentication attempts on portable end-user devices, where supported. For laptops, do not allow more than 20 failed authentication attempts; for tablets and smartphones, no more than 10 failed authentication attempts. Example implementations include Microsoft InTune Device Lock and Apple Configuration Profile maxFailedAttempts.",
        "ref_code": "cis4.j",
        "guidance": "Enforce Automatic Device Lockout on Portable End-User Devices is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Enforce Remote Wipe Capability on Portable End-User Devices",
        "description": "Remotely wipe enterprise data from enterprise-owned portable end-user devices when deemed appropriate such as lost or stolen devices, or when an individual no longer supports the enterprise.",
        "ref_code": "cis4.k",
        "guidance": "Enforce Remote Wipe Capability on Portable End-User Devices is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Separate Enterprise Workspaces on Mobile End-User Devices",
        "description": "Ensure separate enterprise workspaces are used on mobile end-user devices, where supported. Example implementations include using an Apple Configuration Profile or Android Work Profile to separate enterprise applications and data from personal applications and data.",
        "ref_code": "cis4.l",
        "guidance": "Separate Enterprise Workspaces on Mobile End-User Devices is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      }
    ]
  },
  {
    "name": "Account Management",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis5",
    "system_level": false,
    "category": "Account Management",
    "subcategory": "Users",
    "subcontrols": [
      {
        "name": "Establish and Maintain an Inventory of Accounts",
        "description": "Establish and maintain an inventory of all accounts managed in the enterprise. The inventory must include both user and administrator accounts. The inventory, at a minimum, should contain the person's name, username, start/stop dates, and department. Validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently.",
        "ref_code": "cis5.a",
        "guidance": "Establish and Maintain an Inventory of Accounts is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Use Unique Passwords",
        "description": "Use unique passwords for all enterprise assets. Best practice implementation includes, at a minimum, an 8-character password for accounts using MFA and a 14-character password for accounts not using MFA.",
        "ref_code": "cis5.b",
        "guidance": "Use Unique Passwords is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Disable Dormant Accounts",
        "description": "Delete or disable any dormant accounts after a period of 45 days of inactivity, where supported.",
        "ref_code": "cis5.c",
        "guidance": "Disable Dormant Accounts is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Restrict Administrator Privileges to Dedicated Administrator Accounts",
        "description": "Restrict administrator privileges to dedicated administrator accounts on enterprise assets. Conduct general computing activities, such as internet browsing, email, and productivity suite use, from the user's primary, non-privileged account.",
        "ref_code": "cis5.d",
        "guidance": "Restrict Administrator Privileges to Dedicated Administrator Accounts is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain an Inventory of Service Accounts",
        "description": "Establish and maintain an inventory of service accounts. The inventory, at a minimum, must contain department owner, review date, and purpose. Perform service account reviews to validate that all active accounts are authorized, on a recurring schedule at a minimum quarterly, or more frequently.",
        "ref_code": "cis5.e",
        "guidance": "Establish and Maintain an Inventory of Service Accounts is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Centralize Account Management",
        "description": "Centralize account management through a directory or identity service.",
        "ref_code": "cis5.f",
        "guidance": "Centralize Account Management is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Access Control Management",
    "description": "This control manages user access to systems and data. It aims to enforce the principle of least privilege and prevent unauthorized use.",
    "ref_code": "cis6",
    "system_level": false,
    "category": "Access Control Management",
    "subcategory": "Data",
    "subcontrols": [
      {
        "name": "Establish an Access Granting Process",
        "description": "Establish and follow a process, preferably automated, for granting access to enterprise assets upon new hire, rights grant, or role change of a user.",
        "ref_code": "cis6.a",
        "guidance": "Establish an Access Granting Process is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      },
      {
        "name": "Establish an Access Revoking Process",
        "description": "Establish and follow a process, preferably automated, for revoking access to enterprise assets, through disabling accounts immediately upon termination, rights revocation, or role change of a user. Disabling accounts, instead of deleting accounts, may be necessary to preserve audit trails.",
        "ref_code": "cis6.b",
        "guidance": "Establish an Access Revoking Process is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      },
      {
        "name": "Require MFA for Externally-Exposed Applications",
        "description": "Require all externally-exposed enterprise or third-party applications to enforce MFA, where supported. Enforcing MFA through a directory service or SSO provider is a satisfactory implementation of this Safeguard.",
        "ref_code": "cis6.c",
        "guidance": "Require MFA for Externally-Exposed Applications is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Require MFA for Remote Network Access",
        "description": "Require MFA for remote network access.",
        "ref_code": "cis6.d",
        "guidance": "Require MFA for Remote Network Access is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      },
      {
        "name": "Require MFA for Administrative Access",
        "description": "Require MFA for all administrative access accounts, where supported, on all enterprise assets, whether managed on-site or through a third-party provider.",
        "ref_code": "cis6.e",
        "guidance": "Require MFA for Administrative Access is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      },
      {
        "name": "Establish and Maintain an Inventory of Authentication and Authorization Systems",
        "description": "Establish and maintain an inventory of the enterprise's authentication and authorization systems, including those hosted on-site or at a remote service provider. Review and update the inventory, at a minimum, annually, or more frequently.",
        "ref_code": "cis6.f",
        "guidance": "Establish and Maintain an Inventory of Authentication and Authorization Systems is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Centralize Access Control",
        "description": "Centralize access control for all enterprise assets through a directory service or SSO provider, where supported.",
        "ref_code": "cis6.g",
        "guidance": "Centralize Access Control is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      },
      {
        "name": "Define and Maintain Role-Based Access Control",
        "description": "Define and maintain role-based access control, through determining and documenting the access rights necessary for each role within the enterprise to successfully carry out its assigned duties. Perform access control reviews of enterprise assets to validate that all privileges are authorized, on a recurring schedule at a minimum annually, or more frequently.",
        "ref_code": "cis6.h",
        "guidance": "Define and Maintain Role-Based Access Control is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      }
    ]
  },
  {
    "name": "Continuous Vulnerability Management",
    "description": "This control manages identification and remediation of system weaknesses. It helps reduce the attack surface and prevent exploitation.",
    "ref_code": "cis7",
    "system_level": false,
    "category": "Continuous Vulnerability Management",
    "subcategory": "Applications",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Vulnerability Management Process",
        "description": "Establish and maintain a documented vulnerability management process for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis7.a",
        "guidance": "Establish and Maintain a Vulnerability Management Process is an important step toward reducing risk. Conduct routine vulnerability scans and maintain an active patch management process. Prioritize remediation based on severity and exposure."
      },
      {
        "name": "Establish and Maintain a Remediation Process",
        "description": "Establish and maintain a risk-based remediation strategy documented in a remediation process, with monthly, or more frequent, reviews.",
        "ref_code": "cis7.b",
        "guidance": "Establish and Maintain a Remediation Process is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Perform Automated Operating System Patch Management",
        "description": "Perform operating system updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.",
        "ref_code": "cis7.c",
        "guidance": "Perform Automated Operating System Patch Management is an important step toward reducing risk. Conduct routine vulnerability scans and maintain an active patch management process. Prioritize remediation based on severity and exposure."
      },
      {
        "name": "Perform Automated Application Patch Management",
        "description": "Perform application updates on enterprise assets through automated patch management on a monthly, or more frequent, basis.",
        "ref_code": "cis7.d",
        "guidance": "Perform Automated Application Patch Management is an important step toward reducing risk. Conduct routine vulnerability scans and maintain an active patch management process. Prioritize remediation based on severity and exposure."
      },
      {
        "name": "Perform Automated Vulnerability Scans of Internal Enterprise Assets",
        "description": "Perform automated vulnerability scans of internal enterprise assets on a quarterly, or more frequent, basis. Conduct both authenticated and unauthenticated scans, using a SCAP-compliant vulnerability scanning tool.",
        "ref_code": "cis7.e",
        "guidance": "Perform Automated Vulnerability Scans of Internal Enterprise Assets is an important step toward reducing risk. Conduct routine vulnerability scans and maintain an active patch management process. Prioritize remediation based on severity and exposure."
      },
      {
        "name": "Perform Automated Vulnerability Scans of Externally-Exposed Enterprise Assets",
        "description": "Perform automated vulnerability scans of externally-exposed enterprise assets using a SCAP-compliant vulnerability scanning tool. Perform scans on a monthly, or more frequent, basis.",
        "ref_code": "cis7.f",
        "guidance": "Perform Automated Vulnerability Scans of Externally-Exposed Enterprise Assets is an important step toward reducing risk. Conduct routine vulnerability scans and maintain an active patch management process. Prioritize remediation based on severity and exposure."
      },
      {
        "name": "Remediate Detected Vulnerabilities",
        "description": "Remediate detected vulnerabilities in software through processes and tooling on a monthly, or more frequent, basis, based on the remediation process.",
        "ref_code": "cis7.g",
        "guidance": "Remediate Detected Vulnerabilities is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Audit Log Management",
    "description": "This control supports the collection and review of security-relevant events. It enables accountability and detection of malicious activity.",
    "ref_code": "cis8",
    "system_level": false,
    "category": "Audit Log Management",
    "subcategory": "Data",
    "subcontrols": [
      {
        "name": "Establish and Maintain an Audit Log Management Process",
        "description": "Establish and maintain an audit log management process that defines the enterprise's logging requirements. At a minimum, address the collection, review, and retention of audit logs for enterprise assets. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis8.a",
        "guidance": "Establish and Maintain an Audit Log Management Process is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Collect Audit Logs",
        "description": "Collect audit logs. Ensure that logging, per the enterprise's audit log management process, has been enabled across enterprise assets.",
        "ref_code": "cis8.b",
        "guidance": "Collect Audit Logs is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Ensure Adequate Audit Log Storage",
        "description": "Ensure that logging destinations maintain adequate storage to comply with the enterprise's audit log management process.",
        "ref_code": "cis8.c",
        "guidance": "Ensure Adequate Audit Log Storage is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Standardize Time Synchronization",
        "description": "Standardize time synchronization. Configure at least two synchronized time sources across enterprise assets, where supported.",
        "ref_code": "cis8.d",
        "guidance": "Standardize Time Synchronization is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Collect Detailed Audit Logs",
        "description": "Configure detailed audit logging for enterprise assets containing sensitive data. Include event source, date, username, timestamp, source addresses, destination addresses, and other useful elements that could assist in a forensic investigation.",
        "ref_code": "cis8.e",
        "guidance": "Collect Detailed Audit Logs is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Collect DNS Query Audit Logs",
        "description": "Collect DNS query audit logs on enterprise assets, where appropriate and supported.",
        "ref_code": "cis8.f",
        "guidance": "Collect DNS Query Audit Logs is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Collect URL Request Audit Logs",
        "description": "Collect URL request audit logs on enterprise assets, where appropriate and supported.",
        "ref_code": "cis8.g",
        "guidance": "Collect URL Request Audit Logs is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Collect Command-Line Audit Logs",
        "description": "Collect command-line audit logs. Example implementations include collecting audit logs from PowerShell, BASH, and remote administrative terminals.",
        "ref_code": "cis8.h",
        "guidance": "Collect Command-Line Audit Logs is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Centralize Audit Logs",
        "description": "Centralize, to the extent possible, audit log collection and retention across enterprise assets.",
        "ref_code": "cis8.i",
        "guidance": "Centralize Audit Logs is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Retain Audit Logs",
        "description": "Retain audit logs across enterprise assets for a minimum of 90 days.",
        "ref_code": "cis8.j",
        "guidance": "Retain Audit Logs is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Conduct Audit Log Reviews",
        "description": "Conduct reviews of audit logs to detect anomalies or abnormal events that could indicate a potential threat. Conduct reviews on a weekly, or more frequent, basis.",
        "ref_code": "cis8.k",
        "guidance": "Conduct Audit Log Reviews is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Collect Service Provider Logs",
        "description": "Collect service provider logs, where supported. Example implementations include collecting authentication and authorization events, data creation and disposal events, and user management events.",
        "ref_code": "cis8.l",
        "guidance": "Collect Service Provider Logs is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Email and Web Browser Protections",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis9",
    "system_level": false,
    "category": "Email and Web Browser Protections",
    "subcategory": "Network",
    "subcontrols": [
      {
        "name": "Ensure Use of Only Fully Supported Browsers and Email Clients",
        "description": "Ensure only fully supported browsers and email clients are allowed to execute in the enterprise, only using the latest version of browsers and email clients provided through the vendor.",
        "ref_code": "cis9.a",
        "guidance": "Ensure Use of Only Fully Supported Browsers and Email Clients is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Use DNS Filtering Services",
        "description": "Use DNS filtering services on all enterprise assets to block access to known malicious domains.",
        "ref_code": "cis9.b",
        "guidance": "Use DNS Filtering Services is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Maintain and Enforce Network-Based URL Filters",
        "description": "Enforce and update network-based URL filters to limit an enterprise asset from connecting to potentially malicious or unapproved websites. Example implementations include category-based filtering, reputation-based filtering, or through the use of block lists. Enforce filters for all enterprise assets.",
        "ref_code": "cis9.c",
        "guidance": "Maintain and Enforce Network-Based URL Filters is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Restrict Unnecessary or Unauthorized Browser and Email Client Extensions",
        "description": "Restrict, either through uninstalling or disabling, any unauthorized or unnecessary browser or email client plugins, extensions, and add-on applications.",
        "ref_code": "cis9.d",
        "guidance": "Restrict Unnecessary or Unauthorized Browser and Email Client Extensions is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Implement DMARC",
        "description": "To lower the chance of spoofed or modified emails from valid domains, implement DMARC policy and verification, starting with implementing the Sender Policy Framework (SPF) and the DomainKeys Identified Mail (DKIM) standards.",
        "ref_code": "cis9.e",
        "guidance": "Implement DMARC is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Block Unnecessary File Types",
        "description": "Block unnecessary file types attempting to enter the enterprise's email gateway.",
        "ref_code": "cis9.f",
        "guidance": "Block Unnecessary File Types is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Deploy and Maintain Email Server Anti-Malware Protections",
        "description": "Deploy and maintain email server anti-malware protections, such as attachment scanning and/or sandboxing.",
        "ref_code": "cis9.g",
        "guidance": "Deploy and Maintain Email Server Anti-Malware Protections is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Malware Defenses",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis10",
    "system_level": false,
    "category": "Malware Defenses",
    "subcategory": "Devices",
    "subcontrols": [
      {
        "name": "Deploy and Maintain Anti-Malware Software",
        "description": "Deploy and maintain anti-malware software on all enterprise assets.",
        "ref_code": "cis10.a",
        "guidance": "Deploy and Maintain Anti-Malware Software is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Configure Automatic Anti-Malware Signature Updates",
        "description": "Configure automatic updates for anti-malware signature files on all enterprise assets.",
        "ref_code": "cis10.b",
        "guidance": "Configure Automatic Anti-Malware Signature Updates is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Disable Autorun and Autoplay for Removable Media",
        "description": "Disable autorun and autoplay auto-execute functionality for removable media.",
        "ref_code": "cis10.c",
        "guidance": "Disable Autorun and Autoplay for Removable Media is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Configure Automatic Anti-Malware Scanning of Removable Media",
        "description": "Configure anti-malware software to automatically scan removable media.",
        "ref_code": "cis10.d",
        "guidance": "Configure Automatic Anti-Malware Scanning of Removable Media is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Enable Anti-Exploitation Features",
        "description": "Enable anti-exploitation features on enterprise assets and software, where possible, such as Microsoft Data Execution Prevention (DEP), Windows Defender Exploit Guard (WDEG), or Apple System Integrity Protection (SIP) and Gatekeeper.",
        "ref_code": "cis10.e",
        "guidance": "Enable Anti-Exploitation Features is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Centrally Manage Anti-Malware Software",
        "description": "Centrally manage anti-malware software.",
        "ref_code": "cis10.f",
        "guidance": "Centrally Manage Anti-Malware Software is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Use Behavior-Based Anti-Malware Software",
        "description": "Use behavior-based anti-malware software.",
        "ref_code": "cis10.g",
        "guidance": "Use Behavior-Based Anti-Malware Software is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Data Recovery",
    "description": "This control focuses on securing sensitive data at rest and in transit. It helps prevent data loss and unauthorized disclosure.",
    "ref_code": "cis11",
    "system_level": false,
    "category": "Data Recovery",
    "subcategory": "Data",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Data Recovery Process",
        "description": "Establish and maintain a data recovery process. In the process, address the scope of data recovery activities, recovery prioritization, and the security of backup data. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis11.a",
        "guidance": "Establish and Maintain a Data Recovery Process is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Perform Automated Backups",
        "description": "Perform automated backups of in-scope enterprise assets. Run backups weekly, or more frequently, based on the sensitivity of the data.",
        "ref_code": "cis11.b",
        "guidance": "Perform Automated Backups is an important step toward reducing risk. Use encrypted, versioned backups stored in secure offsite or cloud locations. Regularly test backup restoration procedures."
      },
      {
        "name": "Protect Recovery Data",
        "description": "Protect recovery data with equivalent controls to the original data. Reference encryption or data separation, based on requirements.",
        "ref_code": "cis11.c",
        "guidance": "Protect Recovery Data is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain an Isolated Instance of Recovery Data",
        "description": "Establish and maintain an isolated instance of recovery data. Example implementations include version controlling backup destinations through offline, cloud, or off-site systems or services.",
        "ref_code": "cis11.d",
        "guidance": "Establish and Maintain an Isolated Instance of Recovery Data is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Test Data Recovery",
        "description": "Test backup recovery quarterly, or more frequently, for a sampling of in-scope enterprise assets.",
        "ref_code": "cis11.e",
        "guidance": "Test Data Recovery is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Network Infrastructure Management",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis12",
    "system_level": false,
    "category": "Network Infrastructure Management",
    "subcategory": "Devices",
    "subcontrols": [
      {
        "name": "Ensure Network Infrastructure is Up-to-Date",
        "description": "Ensure network infrastructure is kept up-to-date. Example implementations include running the latest stable release of software and/or using currently supported network-as-a-service (NaaS) offerings. Review software versions monthly, or more frequently, to verify software support.",
        "ref_code": "cis12.a",
        "guidance": "Ensure Network Infrastructure is Up-to-Date is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Establish and Maintain a Secure Network Architecture",
        "description": "Establish and maintain a secure network architecture. A secure network architecture must address segmentation, least privilege, and availability, at a minimum.",
        "ref_code": "cis12.b",
        "guidance": "Establish and Maintain a Secure Network Architecture is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Securely Manage Network Infrastructure",
        "description": "Securely manage network infrastructure. Example implementations include version-controlled-infrastructure-as-code, and the use of secure network protocols, such as SSH and HTTPS.",
        "ref_code": "cis12.c",
        "guidance": "Securely Manage Network Infrastructure is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Establish and Maintain Architecture Diagram(s)",
        "description": "Establish and maintain architecture diagram(s) and/or other network system documentation. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis12.d",
        "guidance": "Establish and Maintain Architecture Diagram(s) is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Centralize Network Authentication, Authorization, and Auditing (AAA)",
        "description": "Centralize network AAA.",
        "ref_code": "cis12.e",
        "guidance": "Centralize Network Authentication, Authorization, and Auditing (AAA) is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Use of Secure Network Management and Communication Protocols",
        "description": "Use secure network management and communication protocols (e.g., 802.1X, Wi-Fi Protected Access 2 (WPA2) Enterprise or greater).",
        "ref_code": "cis12.f",
        "guidance": "Use of Secure Network Management and Communication Protocols is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Ensure Remote Devices Utilize a VPN and are Connecting to an Enterprise's AAA Infrastructure",
        "description": "Require users to authenticate to enterprise-managed VPN and authentication services prior to accessing enterprise resources on end-user devices.",
        "ref_code": "cis12.g",
        "guidance": "Ensure Remote Devices Utilize a VPN and are Connecting to an Enterprise's AAA Infrastructure is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain Dedicated Computing Resources For all Administrative Work",
        "description": "Establish and maintain dedicated computing resources, either physically or logically separated, for all administrative tasks or tasks requiring administrative access. The computing resources should be segmented from the enterprise's primary network and not be allowed internet access.",
        "ref_code": "cis12.h",
        "guidance": "Establish and Maintain Dedicated Computing Resources For all Administrative Work is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Network Monitoring and Defense",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis13",
    "system_level": false,
    "category": "Network Monitoring and Defense",
    "subcategory": "Network",
    "subcontrols": [
      {
        "name": "Centralize Security Event Alerting",
        "description": "Centralize security event alerting across enterprise assets for log correlation and analysis. Best practice implementation requires the use of a SIEM, which includes vendor-defined event correlation alerts. A log analytics platform configured with security-relevant correlation alerts also satisfies this Safeguard.",
        "ref_code": "cis13.a",
        "guidance": "Centralize Security Event Alerting is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Deploy a Host-Based Intrusion Detection Solution",
        "description": "Deploy a host-based intrusion detection solution on enterprise assets, where appropriate and/or supported.",
        "ref_code": "cis13.b",
        "guidance": "Deploy a Host-Based Intrusion Detection Solution is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Deploy a Network Intrusion Detection Solution",
        "description": "Deploy a network intrusion detection solution on enterprise assets, where appropriate. Example implementations include the use of a Network Intrusion Detection System (NIDS) or equivalent cloud service provider (CSP) service.",
        "ref_code": "cis13.c",
        "guidance": "Deploy a Network Intrusion Detection Solution is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Perform Traffic Filtering Between Network Segments",
        "description": "Perform traffic filtering between network segments, where appropriate.",
        "ref_code": "cis13.d",
        "guidance": "Perform Traffic Filtering Between Network Segments is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Manage Access Control for Remote Assets",
        "description": "Manage access control for assets remotely connecting to enterprise resources. Determine amount of access to enterprise resources based on: up-to-date anti-malware software installed; configuration compliance with the enterprise's secure configuration process; and ensuring the operating system and applications are up-to-date.",
        "ref_code": "cis13.e",
        "guidance": "Manage Access Control for Remote Assets is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Collect Network Traffic Flow Logs",
        "description": "Collect network traffic flow logs and/or network traffic to review and alert upon from network devices.",
        "ref_code": "cis13.f",
        "guidance": "Collect Network Traffic Flow Logs is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Deploy a Host-Based Intrusion Prevention Solution",
        "description": "Deploy a host-based intrusion prevention solution on enterprise assets, where appropriate and/or supported. Example implementations include use of an Endpoint Detection and Response (EDR) client or host-based IPS agent.",
        "ref_code": "cis13.g",
        "guidance": "Deploy a Host-Based Intrusion Prevention Solution is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Deploy a Network Intrusion Prevention Solution",
        "description": "Deploy a network intrusion prevention solution, where appropriate. Example implementations include the use of a Network Intrusion Prevention System (NIPS) or equivalent CSP service.",
        "ref_code": "cis13.h",
        "guidance": "Deploy a Network Intrusion Prevention Solution is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Deploy Port-Level Access Control",
        "description": "Deploy port-level access control. Port-level access control utilizes 802.1x, or similar network access control protocols, such as certificates, and may incorporate user and/or device authentication.",
        "ref_code": "cis13.i",
        "guidance": "Deploy Port-Level Access Control is an important step toward reducing risk. Implement role-based access control and enforce least privilege. Review and remove unnecessary accounts and permissions on a regular schedule."
      },
      {
        "name": "Perform Application Layer Filtering",
        "description": "Perform application layer filtering. Example implementations include a filtering proxy, application layer firewall, or gateway.",
        "ref_code": "cis13.j",
        "guidance": "Perform Application Layer Filtering is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Tune Security Event Alerting Thresholds",
        "description": "Tune security event alerting thresholds monthly, or more frequently.",
        "ref_code": "cis13.k",
        "guidance": "Tune Security Event Alerting Thresholds is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Security Awareness and Skills Training",
    "description": "This control promotes security awareness and training for all personnel. It helps reduce human risk and reinforces secure behavior.",
    "ref_code": "cis14",
    "system_level": false,
    "category": "Security Awareness and Skills Training",
    "subcategory": "N/A",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Security Awareness Program",
        "description": "Establish and maintain a security awareness program. The purpose of a security awareness program is to educate the enterprise's workforce on how to interact with enterprise assets and data in a secure manner. Conduct training at hire and, at a minimum, annually. Review and update content annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis14.a",
        "guidance": "Establish and Maintain a Security Awareness Program is an important step toward reducing risk. Develop a recurring training program tailored to user roles and threats. Track completion and evaluate effectiveness through testing and simulations."
      },
      {
        "name": "Train Workforce Members to Recognize Social Engineering Attacks",
        "description": "Train workforce members to recognize social engineering attacks, such as phishing, pre-texting, and tailgating.",
        "ref_code": "cis14.b",
        "guidance": "Train Workforce Members to Recognize Social Engineering Attacks is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Train Workforce Members on Authentication Best Practices",
        "description": "Train workforce members on authentication best practices. Example topics include MFA, password composition, and credential management.",
        "ref_code": "cis14.c",
        "guidance": "Train Workforce Members on Authentication Best Practices is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Train Workforce on Data Handling Best Practices",
        "description": "Train workforce members on how to identify and properly store, transfer, archive, and destroy sensitive data. This also includes training workforce members on clear screen and desk best practices, such as locking their screen when they step away from their enterprise asset, erasing physical and virtual whiteboards at the end of meetings, and storing data and assets securely.",
        "ref_code": "cis14.d",
        "guidance": "Train Workforce on Data Handling Best Practices is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Train Workforce Members on Causes of Unintentional Data Exposure",
        "description": "Train workforce members to be aware of causes for unintentional data exposure. Example topics include mis-delivery of sensitive data, losing a portable end-user device, or publishing data to unintended audiences.",
        "ref_code": "cis14.e",
        "guidance": "Train Workforce Members on Causes of Unintentional Data Exposure is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Train Workforce Members on Recognizing and Reporting Security Incidents",
        "description": "Train workforce members to be able to recognize a potential incident and be able to report such an incident.",
        "ref_code": "cis14.f",
        "guidance": "Train Workforce Members on Recognizing and Reporting Security Incidents is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Train Workforce on How to Identify and Report if Their Enterprise Assets are Missing Security Updates",
        "description": "Train workforce to understand how to verify and report out-of-date software patches or any failures in automated processes and tools. Part of this training should include notifying IT personnel of any failures in automated processes and tools.",
        "ref_code": "cis14.g",
        "guidance": "Train Workforce on How to Identify and Report if Their Enterprise Assets are Missing Security Updates is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Train Workforce on the Dangers of Connecting to and Transmitting Enterprise Data Over Insecure Networks",
        "description": "Train workforce members on the dangers of connecting to, and transmitting data over, insecure networks for enterprise activities. If the enterprise has remote workers, training must include guidance to ensure that all users securely configure their home network infrastructure.",
        "ref_code": "cis14.h",
        "guidance": "Train Workforce on the Dangers of Connecting to and Transmitting Enterprise Data Over Insecure Networks is an important step toward reducing risk. Segment critical network assets and restrict access using firewalls and ACLs. Monitor for unauthorized connections or traffic anomalies."
      },
      {
        "name": "Conduct Role-Specific Security Awareness and Skills Training",
        "description": "Conduct role-specific security awareness and skills training. Example implementations include secure system administration courses for IT professionals, (OWASP's Top 10 vulnerability awareness and prevention training for web application developers, and advanced social engineering awareness training for high-profile roles.",
        "ref_code": "cis14.i",
        "guidance": "Conduct Role-Specific Security Awareness and Skills Training is an important step toward reducing risk. Develop a recurring training program tailored to user roles and threats. Track completion and evaluate effectiveness through testing and simulations."
      }
    ]
  },
  {
    "name": "Service Provider Management",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis15",
    "system_level": false,
    "category": "Service Provider Management",
    "subcategory": "Data",
    "subcontrols": [
      {
        "name": "Establish and Maintain an Inventory of Service Providers",
        "description": "Establish and maintain an inventory of service providers. The inventory is to list all known service providers, include classification(s), and designate an enterprise contact for each service provider. Review and update the inventory annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis15.a",
        "guidance": "Establish and Maintain an Inventory of Service Providers is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Establish and Maintain a Service Provider Management Policy",
        "description": "Establish and maintain a service provider management policy. Ensure the policy addresses the classification, inventory, assessment, monitoring, and decommissioning of service providers. Review and update the policy annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis15.b",
        "guidance": "Establish and Maintain a Service Provider Management Policy is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Classify Service Providers",
        "description": "Classify service providers. Classification consideration may include one or more characteristics, such as data sensitivity, data volume, availability requirements, applicable regulations, inherent risk, and mitigated risk. Update and review classifications annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis15.c",
        "guidance": "Classify Service Providers is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Ensure Service Provider Contracts Include Security Requirements",
        "description": "Ensure service provider contracts include security requirements. Example requirements may include minimum security program requirements, security incident and/or data breach notification and response, data encryption requirements, and data disposal commitments. These security requirements must be consistent with the enterprise's service provider management policy. Review service provider contracts annually to ensure contracts are not missing security requirements.",
        "ref_code": "cis15.d",
        "guidance": "Ensure Service Provider Contracts Include Security Requirements is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Assess Service Providers",
        "description": "Assess service providers consistent with the enterprise's service provider management policy. Assessment scope may vary based on classification(s), and may include review of standardized assessment reports, such as Service Organization Control 2 (SOC 2) and Payment Card Industry (PCI) Attestation of Compliance (AoC), customized questionnaires, or other appropriately rigorous processes. Reassess service providers annually, at a minimum, or with new and renewed contracts.",
        "ref_code": "cis15.e",
        "guidance": "Assess Service Providers is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Monitor Service Providers",
        "description": "Monitor service providers consistent with the enterprise's service provider management policy. Monitoring may include periodic reassessment of service provider compliance, monitoring service provider release notes, and dark web monitoring.",
        "ref_code": "cis15.f",
        "guidance": "Monitor Service Providers is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Securely Decommission Service Providers",
        "description": "Securely decommission service providers. Example considerations include user and service account deactivation, termination of data flows, and secure disposal of enterprise data within service provider systems.",
        "ref_code": "cis15.g",
        "guidance": "Securely Decommission Service Providers is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Application Software Security",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis16",
    "system_level": false,
    "category": "Application Software Security",
    "subcategory": "Applications",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Secure Application Development Process",
        "description": "Establish and maintain a secure application development process. In the process, address such items as: secure application design standards, secure coding practices, developer training, vulnerability management, security of third-party code, and application security testing procedures. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis16.a",
        "guidance": "Establish and Maintain a Secure Application Development Process is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain a Process to Accept and Address Software Vulnerabilities",
        "description": "Establish and maintain a process to accept and address reports of software vulnerabilities, including providing a means for external entities to report. The process is to include such items as: a vulnerability handling policy that identifies reporting process, responsible party for handling vulnerability reports, and a process for intake, assignment, remediation, and remediation testing. As part of the process, use a vulnerability tracking system that includes severity ratings, and metrics for measuring timing for identification, analysis, and remediation of vulnerabilities. Review and update documentation annually, or when significant enterprise changes occur that could impact this Safeguard. Third-party application developers need to consider this an externally-facing policy that helps to set expectations for outside stakeholders.",
        "ref_code": "cis16.b",
        "guidance": "Establish and Maintain a Process to Accept and Address Software Vulnerabilities is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Perform Root Cause Analysis on Security Vulnerabilities",
        "description": "Perform root cause analysis on security vulnerabilities. When reviewing vulnerabilities, root cause analysis is the task of evaluating underlying issues that create vulnerabilities in code, and allows development teams to move beyond just fixing individual vulnerabilities as they arise.",
        "ref_code": "cis16.c",
        "guidance": "Perform Root Cause Analysis on Security Vulnerabilities is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Manage an Inventory of Third-Party Software Components",
        "description": "Establish and manage an updated inventory of third-party components used in development, often referred to as a bill of materials, as well as components slated for future use.This inventory is to include any risks that each third-party component could pose.Evaluate the list at least monthly to identify any changes or updates to these components, and validate that the component is still supported.",
        "ref_code": "cis16.d",
        "guidance": "Establish and Manage an Inventory of Third-Party Software Components is an important step toward reducing risk. Maintain an up-to-date and accurate inventory using automated discovery tools where possible. Cross-reference with procurement and deployment records to ensure completeness."
      },
      {
        "name": "Use Up-to-Date and Trusted Third-Party Software Components",
        "description": "Use up-to-date and trusted third-party software components. When possible, choose established and proven frameworks and libraries that provide adequate security.Acquire these components from trusted sources or evaluate the software for vulnerabilities before use.",
        "ref_code": "cis16.e",
        "guidance": "Use Up-to-Date and Trusted Third-Party Software Components is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain a Severity Rating System and Process for Application Vulnerabilities",
        "description": "Establish and maintain a severity rating system and process for application vulnerabilities that facilitates prioritizing the order in which discovered vulnerabilities are fixed. This process includes setting a minimum level of security acceptability for releasing code or applications. Severity ratings bring a systematic way of triaging vulnerabilities that improves risk management and helps ensure the most severe bugs are fixed first. Review and update the system and process annually.",
        "ref_code": "cis16.f",
        "guidance": "Establish and Maintain a Severity Rating System and Process for Application Vulnerabilities is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Use Standard Hardening Configuration Templates for Application Infrastructure",
        "description": "Use standard, industry-recommended hardening configuration templates for application infrastructure components. This includes underlying servers, databases, and web servers, and applies to cloud containers, Platform as a Service (PaaS) components, and SaaS components. Do not allow in-house developed software to weaken configuration hardening.",
        "ref_code": "cis16.g",
        "guidance": "Use Standard Hardening Configuration Templates for Application Infrastructure is an important step toward reducing risk. Use secure baselines and configuration management tools to enforce standards. Regularly audit system settings and remediate any deviations promptly."
      },
      {
        "name": "Separate Production and Non-Production Systems",
        "description": "Maintain separate environments for production and non-production systems.",
        "ref_code": "cis16.h",
        "guidance": "Separate Production and Non-Production Systems is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Train Developers in Application Security Concepts and Secure Coding",
        "description": "Ensure that all software development personnel receive training in writing secure code for their specific development environment and responsibilities. Training can include general security principles and application security standard practices. Conduct training at least annually and design in a way to promote security within the development team, and build a culture of security among the developers.",
        "ref_code": "cis16.i",
        "guidance": "Train Developers in Application Security Concepts and Secure Coding is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Apply Secure Design Principles in Application Architectures",
        "description": "Apply secure design principles in application architectures. Secure design principles include the concept of least privilege and enforcing mediation to validate every operation that the user makes, promoting the concept of \"never trust user input.\" Examples include ensuring that explicit error checking is performed and documented for all input, including for size, data type, and acceptable ranges or formats. Secure design also means minimizing the application infrastructure attack surface, such as turning off unprotected ports and services, removing unnecessary programs and files, and renaming or removing default accounts.",
        "ref_code": "cis16.j",
        "guidance": "Apply Secure Design Principles in Application Architectures is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Leverage Vetted Modules or Services for Application Security Components",
        "description": "Leverage vetted modules or services for application security components, such as identity management, encryption, and auditing and logging. Using platform features in critical security functions will reduce developers workload and minimize the likelihood of design or implementation errors. Modern operating systems provide effective mechanisms for identification, authentication, and authorization and make those mechanisms available to applications. Use only standardized, currently accepted, and extensively reviewed encryption algorithms. Operating systems also provide mechanisms to create and maintain secure audit logs.",
        "ref_code": "cis16.k",
        "guidance": "Leverage Vetted Modules or Services for Application Security Components is an important step toward reducing risk. Enable detailed logging across all critical systems. Send logs to a central system for monitoring, alerting, and forensic analysis."
      },
      {
        "name": "Implement Code-Level Security Checks",
        "description": "Apply static and dynamic analysis tools within the application life cycle to verify that secure coding practices are being followed.",
        "ref_code": "cis16.l",
        "guidance": "Implement Code-Level Security Checks is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Conduct Application Penetration Testing",
        "description": "Conduct application penetration testing. For critical applications, authenticated penetration testing is better suited to finding business logic vulnerabilities than code scanning and automated security testing.Penetration testing relies on the skill of the tester to manually manipulate an application as an authenticated and unauthenticated user.",
        "ref_code": "cis16.m",
        "guidance": "Conduct Application Penetration Testing is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Conduct Threat Modeling",
        "description": "Conduct threat modeling. Threat modeling is the process of identifying and addressing application security design flaws within a design, before code is created. It is conducted through specially trained individuals who evaluate the application design and gauge security risks for each entry point and access level. The goal is to map out the application, architecture, and infrastructure in a structured way to understand its weaknesses.",
        "ref_code": "cis16.n",
        "guidance": "Conduct Threat Modeling is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Incident Response Management",
    "description": "This control defines how the organization detects, responds to, and recovers from incidents. It minimizes disruption and strengthens resilience.",
    "ref_code": "cis17",
    "system_level": false,
    "category": "Incident Response Management",
    "subcategory": "N/A",
    "subcontrols": [
      {
        "name": "Designate Personnel to Manage Incident Handling",
        "description": "Designate one key person, and at least one backup, who will manage the enterprise's incident handling process. Management personnel are responsible for the coordination and documentation of incident response and recovery efforts and can consist of employees internal to the enterprise, third-party vendors, or a hybrid approach. If using a third-party vendor, designate at least one person internal to the enterprise to oversee any third-party work. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis17.a",
        "guidance": "Designate Personnel to Manage Incident Handling is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain Contact Information for Reporting Security Incidents",
        "description": "Establish and maintain contact information for parties that need to be informed of security incidents. Contacts may include internal staff, third-party vendors, law enforcement, cyber insurance providers, relevant government agencies, Information Sharing and Analysis Center (ISAC) partners, or other stakeholders. Verify contacts annually to ensure that information is up-to-date.",
        "ref_code": "cis17.b",
        "guidance": "Establish and Maintain Contact Information for Reporting Security Incidents is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain an Enterprise Process for Reporting Incidents",
        "description": "Establish and maintain an enterprise process for the workforce to report security incidents. The process includes reporting timeframe, personnel to report to, mechanism for reporting, and the minimum information to be reported. Ensure the process is publicly available to all of the workforce. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis17.c",
        "guidance": "Establish and Maintain an Enterprise Process for Reporting Incidents is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain an Incident Response Process",
        "description": "Establish and maintain an incident response process that addresses roles and responsibilities, compliance requirements, and a communication plan. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis17.d",
        "guidance": "Establish and Maintain an Incident Response Process is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Assign Key Roles and Responsibilities",
        "description": "Assign key roles and responsibilities for incident response, including staff from legal, IT, information security, facilities, public relations, human resources, incident responders, and analysts, as applicable. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis17.e",
        "guidance": "Assign Key Roles and Responsibilities is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Define Mechanisms for Communicating During Incident Response",
        "description": "Determine which primary and secondary mechanisms will be used to communicate and report during a security incident. Mechanisms can include phone calls, emails, or letters. Keep in mind that certain mechanisms, such as emails, can be affected during a security incident. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis17.f",
        "guidance": "Define Mechanisms for Communicating During Incident Response is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Conduct Routine Incident Response Exercises",
        "description": "Plan and conduct routine incident response exercises and scenarios for key personnel involved in the incident response process to prepare for responding to real-world incidents. Exercises need to test communication channels, decision making, and workflows. Conduct testing on an annual basis, at a minimum.",
        "ref_code": "cis17.g",
        "guidance": "Conduct Routine Incident Response Exercises is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Conduct Post-Incident Reviews",
        "description": "Conduct post-incident reviews. Post-incident reviews help prevent incident recurrence through identifying lessons learned and follow-up action.",
        "ref_code": "cis17.h",
        "guidance": "Conduct Post-Incident Reviews is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Establish and Maintain Security Incident Thresholds",
        "description": "Establish and maintain security incident thresholds, including, at a minimum, differentiating between an incident and an event. Examples can include: abnormal activity, security vulnerability, security weakness, data breach, privacy incident, etc. Review annually, or when significant enterprise changes occur that could impact this Safeguard.",
        "ref_code": "cis17.i",
        "guidance": "Establish and Maintain Security Incident Thresholds is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  },
  {
    "name": "Penetration Testing",
    "description": "This control addresses a foundational security capability. It contributes to the overall integrity, availability, and confidentiality of systems.",
    "ref_code": "cis18",
    "system_level": false,
    "category": "Penetration Testing",
    "subcategory": "N/A",
    "subcontrols": [
      {
        "name": "Establish and Maintain a Penetration Testing Program",
        "description": "Establish and maintain a penetration testing program appropriate to the size, complexity, and maturity of the enterprise. Penetration testing program characteristics include scope, such as network, web application, Application Programming Interface (API), hosted services, and physical premise controls; frequency; limitations, such as acceptable hours, and excluded attack types; point of contact information; remediation, such as how findings will be routed internally; and retrospective requirements.",
        "ref_code": "cis18.a",
        "guidance": "Establish and Maintain a Penetration Testing Program is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Perform Periodic External Penetration Tests",
        "description": "Perform periodic external penetration tests based on program requirements, no less than annually. External penetration testing must include enterprise and environmental reconnaissance to detect exploitable information. Penetration testing requires specialized skills and experience and must be conducted through a qualified party. The testing may be clear box or opaque box.",
        "ref_code": "cis18.b",
        "guidance": "Perform Periodic External Penetration Tests is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Remediate Penetration Test Findings",
        "description": "Remediate penetration test findings based on the enterprise's policy for remediation scope and prioritization.",
        "ref_code": "cis18.c",
        "guidance": "Remediate Penetration Test Findings is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Validate Security Measures",
        "description": "Validate security measures after each penetration test. If deemed necessary, modify rulesets and capabilities to detect the techniques used during testing.",
        "ref_code": "cis18.d",
        "guidance": "Validate Security Measures is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      },
      {
        "name": "Perform Periodic Internal Penetration Tests",
        "description": "Perform periodic internal penetration tests based on program requirements, no less than annually. The testing may be clear box or opaque box.",
        "ref_code": "cis18.e",
        "guidance": "Perform Periodic Internal Penetration Tests is an important step toward reducing risk. Follow documented security best practices and align with your organization's risk management strategy. Implement controls that are auditable and continuously improved."
      }
    ]
  }
]