[
  {
    "name": "Context of the organization.",
    "description": "This control focuses on understanding the internal and external factors that influence an organization's information security objectives, allowing for a tailored and relevant Information Security Management System (ISMS).",
    "guidance": "ISO 27001:2022 Control 'Context of the Organization' requires defining the internal and external factors influencing your ISMS. Identify key stakeholders, understand legal/regulatory requirements, and assess the organization's strategic objectives, culture, and capabilities. Document these contextual elements to inform risk assessments and guide ISMS implementation.",
    "ref_code": "C.4",
    "subcontrols": [
      {
        "ref_code": "C.4.1",
        "name": "Understanding the Organization and its Context",
        "description": "The organization shall determine external and internal issues that are relevant to its purpose and that affect its ability to achieve the intended outcome(s) of its information security management system.",
        "guidance": "The organization should conduct an internal and external analysis by identifying factors such as regulatory requirements, market conditions, technological changes, and organizational structure that could impact its information security management system (ISMS). This can be done through stakeholder interviews, risk assessments, and reviewing industry best practices. Document these findings and integrate them into the ISMS planning process to ensure alignment with business objectives and security goals."
      },
      {
        "ref_code": "C.4.2",
        "name": "Understanding the Needs and Expectations of Interested Parties",
        "description": "The organization shall determine: a) interested parties that are relevant to the information security management system; b) the relevant requirements of these interested parties; c) which of these requirements will be addressed through the information security management system.",
        "guidance": "The organization should identify key stakeholders such as employees, customers, regulators, and partners who have an interest in or are affected by the information security management system (ISMS). Conduct discussions, surveys, or document reviews to determine their security expectations and compliance requirements. Finally, analyze these requirements and integrate the relevant ones into the ISMS to ensure alignment with business needs and regulatory obligations."
      },
      {
        "ref_code": "C.4.3",
        "name": "Determining the Scope of the ISMS",
        "description": "The organization shall determine the boundaries and applicability of the information security management system to establish its scope. When determining this scope, the organization shall consider: a) the external and internal issues referred to in 4.1; b) the requirements referred to in 4.2; c) interfaces and dependencies between activities performed by the organization, and those that are performed by other organizations. The scope shall be available as documented information.",
        "guidance": "The organization should define the boundaries of its Information Security Management System (ISMS) by considering internal and external factors, stakeholder requirements, and dependencies on third parties. This involves identifying the locations, processes, information assets, and technologies covered by the ISMS. The final scope should be clearly documented and made available to relevant stakeholders to ensure transparency and alignment with security objectives."
      },
      {
        "ref_code": "C.4.4",
        "name": "Information Security Management System",
        "description": "The organization shall establish, implement, maintain and continually improve an information security management system, including the processes needed and their interactions, in accordance with the requirements of this document.",
        "guidance": "The organization should develop a structured Information Security Management System (ISMS) that aligns with business objectives and security requirements."
      }
    ]
  },
  {
    "name": "Leadership as core control iso 27001:2022.",
    "description": "Leadership, as a core control in ISO 27001:2022, emphasizes the vital role of top management in demonstrating commitment and providing resources to effectively establish, implement, maintain, and continually improve the information security management system (ISMS).",
    "guidance": "Define information security responsibilities and demonstrate leadership commitment by establishing and communicating an information security policy. Ensure top management actively supports and participates in information security activities.  Allocate adequate resources for implementation and maintenance of the information security program.",
    "ref_code": "C.5",
    "subcontrols": [
      {
        "ref_code": "C.5.1",
        "name": "Leadership and Commitment",
        "description": "Top management shall demonstrate leadership and commitment with respect to the information security management system by: a) ensuring the information security policy and the information security objectives are established and are compatible with the strategic direction of the organization; b) ensuring the integration of the information security management system requirements into the organization's processes; c) ensuring that the resources needed for the information security management system are available; d) communicating the importance of effective information security management and of conforming to the information security management system requirements; e) ensuring that the information security management system achieves its intended outcome(s); f) directing and supporting persons to contribute to the effectiveness of the information security management system; g) promoting continual improvement; and h) supporting other relevant management roles to demonstrate their leadership as it applies to their areas of responsibility.",
        "guidance": "The organization's top management should actively lead and support the Information Security Management System (ISMS) by aligning security policies and objectives with the organization's strategic direction. They must integrate ISMS requirements into business processes, allocate necessary resources, and promote a culture of security awareness and compliance. Leadership should also ensure continuous improvement, communicate the importance of security, and empower employees at all levels to contribute to the effectiveness of the ISMS."
      },
      {
        "ref_code": "C.5.2",
        "name": "Information Security Policy",
        "description": "Top management shall establish an information security policy that: a) is appropriate to the purpose of the organization; b) includes information security objectives (see 6.2) or provides the framework for setting information security objectives; c) includes a commitment to satisfy applicable requirements related to information security; d) includes a commitment to continual improvement of the information security management system. The information security policy shall: e) be available as documented information; f) be communicated within the organization; g) be available to interested parties, as appropriate.",
        "guidance": "Top management should develop an information security policy that aligns with the organization's purpose and establishes clear security objectives. The policy must demonstrate a commitment to meeting security requirements and continuous improvement of the Information Security Management System (ISMS). It should be documented, effectively communicated within the organization, and made available to relevant stakeholders as needed."
      },
      {
        "ref_code": "C.5.3",
        "name": "Organizational Roles, Responsibilities, and Authorities",
        "description": "Top management shall ensure that the responsibilities and authorities for roles relevant to information security are assigned and communicated within the organization. Top management shall assign the responsibility and authority for: a) ensuring that the information security management system conforms to the requirements of this document; b) reporting on the performance of the information security management system to top management.",
        "guidance": "Top management should define and assign clear roles and responsibilities for information security within the organization. They must designate individuals to ensure the Information Security Management System (ISMS) meets requirements and regularly report on its performance. These responsibilities should be clearly communicated to ensure accountability and effective governance of the ISMS."
      }
    ]
  },
  {
    "name": "Ensure planning control requires organization establish comprehensive.",
    "description": "The 'Planning' control requires the organization to establish a comprehensive plan to identify, assess, and address information security risks, including defining the scope of the ISMS and establishing relevant objectives.",
    "guidance": "To comply with the ISO 27001:2022 control 'Planning,' establish a structured approach to information security, defining objectives, scope, and the management system's framework. This involves identifying risks, resources, and timelines for implementation and ongoing maintenance. Finally, document the planning process and its outputs to ensure traceability and enable continuous improvement.",
    "ref_code": "C.6",
    "subcontrols": [
      {
        "ref_code": "C.6.1",
        "name": "Actions to Address Risks and Opportunities",
        "description": "This control requires organizations to plan and implement actions to address identified information security risks and opportunities, ensuring alignment with overall objectives.",
        "guidance": "Identify and assess information security risks and opportunities. Develop and implement a plan outlining controls and actions to mitigate identified risks and capitalize on opportunities, ensuring alignment with organizational objectives. Regularly monitor and review the effectiveness of implemented actions."
      },
      {
        "ref_code": "C.6.2",
        "name": "Information Security Objectives and Planning to Achieve Them",
        "description": "The organization shall establish information security objectives at relevant functions and levels. The information security objectives shall: a) be consistent with the information security policy; b) be measurable (if practicable); c) take into account applicable information security requirements, and results from risk assessment and risk treatment; d) be monitored; e) be communicated; f) be updated as appropriate; g) be available as documented information. The organization shall retain documented information on the information security objectives. When planning how to achieve its information security objectives, the organization shall determine: h) what will be done; i) j) what resources will be required; who will be responsible; k) when it will be completed; and l) 6.3 how the results will be evaluated.",
        "guidance": "The organization should establish clear information security objectives that align with its security policy and compliance requirements. These objectives must be measurable, regularly monitored, communicated, and updated as needed. The organization should document these objectives and develop a structured plan detailing required actions, assigned responsibilities, necessary resources, timelines, and evaluation methods to ensure continuous improvement."
      },
      {
        "ref_code": "C.6.3",
        "name": "Planning of Changes",
        "description": "When the organization determines the need for changes to the information security management system, the changes shall be carried out in a planned manner.",
        "guidance": "The organization should implement changes to the Information Security Management System (ISMS) in a structured and controlled manner. This includes assessing potential impacts, planning necessary adjustments, allocating resources, and ensuring proper documentation. Changes should be reviewed and monitored to maintain system integrity and effectiveness."
      }
    ]
  },
  {
    "name": "Ensure planning information security management system.",
    "description": "When planning for the information security management system, the organization shall consider the issues referred to in 4.1 and the requirements referred to in 4.2 and determine the risks and opportunities that need to be addressed to: a) ensure the information security management system can achieve its intended outcome(s); b) prevent, or reduce, undesired effects; c) achieve continual improvement. The organization shall plan: d) actions to address these risks and opportunities; and e) how to 1) integrate and implement the actions into its information security management system processes; and 2) evaluate the effectiveness of these actions.",
    "guidance": "The organization should assess internal and external factors, along with stakeholder requirements, to identify risks and opportunities affecting the Information Security Management System (ISMS). A structured plan should be developed to mitigate risks, minimize negative impacts, and enhance security measures. This plan must outline specific actions, their integration into ISMS processes, and a method for evaluating their effectiveness to ensure continuous improvement.",
    "ref_code": "C.6.1.1",
    "subcontrols": []
  },
  {
    "name": "Information security risk assessment.",
    "description": "The organization shall define and apply an information security risk assessment process that: a) establishes and maintains information security risk criteria that include: 1) the risk acceptance criteria; and 2) criteria for performing information security risk assessments; b) ensures that repeated information security risk assessments produce consistent, valid and comparable results; c) identifies the information security risks: 1) apply the information security risk assessment process to identify risks associated with the loss of confidentiality, integrity and availability for information within the scope of the information security management system; and 2) identify the risk owners; d) analyses the information security risks: 1) assess the potential consequences that would result if the risks identified in 6.1.2 c) 1) were to materialize; 2) assess the realistic likelihood of the occurrence of the risks identified in 6.1.2 c) 1); and 3) determine the levels of risk; e) evaluates the information security risks: 1) compare the results of risk analysis with the risk criteria established in 6.1.2 a); and 2) prioritize the analysed risks for risk treatment. The organization shall retain documented information about the information security risk assessment process.",
    "guidance": "The organization should establish a structured risk assessment process that defines criteria for evaluating and accepting risks. This process must ensure consistency, identify risks related to confidentiality, integrity, and availability, and assign risk ownership. Risks should be analyzed based on their potential impact and likelihood, then evaluated against predefined criteria to prioritize them for treatment. All risk assessments and outcomes should be documented to support decision-making and compliance.",
    "ref_code": "C.6.1.2",
    "subcontrols": []
  },
  {
    "name": "Information security risk treatment.",
    "description": "The organization shall define and apply an information security risk treatment process to: a) select appropriate information security risk treatment options, taking account of the risk assessment results; b) determine all controls that are necessary to implement the information security risk treatment option(s) chosen; c) compare the controls determined in 6.1.3 b) above with those in Annex A and verify that no necessary controls have been omitted; d) produce a Statement of Applicability that contains: , the necessary controls (see 6.1.3 b) and c)); , justification for their inclusion; , whether the necessary controls are implemented or not; , the justification for excluding any of the Annex A controls. e) formulate an information security risk treatment plan; and f) obtain risk owners' approval of the information security risk treatment plan and acceptance of the residual information security risks. The organization shall retain documented information about the information security risk treatment process.",
    "guidance": "The organization should establish a risk treatment process that selects appropriate security measures based on risk assessment results. It must determine and validate necessary controls, ensuring alignment with Annex A, and document a Statement of Applicability justifying control selections and exclusions. A formal risk treatment plan should be created, approved by risk owners, and include acceptance of any residual risks. All decisions and actions must be documented for compliance and continuous improvement.",
    "ref_code": "C.6.1.3",
    "subcontrols": []
  },
  {
    "name": "Support iso 27001:2022 encompasses resources infrastructure.",
    "description": "'Support' in ISO 27001:2022 encompasses the resources and infrastructure needed to implement and maintain an Information Security Management System (ISMS).",
    "guidance": "To fulfill the 'Support' control, organizations should establish clear processes for providing IT and information security support. This includes documented procedures for incident response, user assistance, and service continuity. Regularly test these support processes to ensure their effectiveness.",
    "ref_code": "C.7",
    "subcontrols": [
      {
        "ref_code": "C.7.1",
        "name": "Resources",
        "description": "The organization shall determine and provide the resources needed for the establishment, implementation, maintenance and continual improvement of the information security management system.",
        "guidance": "The organization should identify and allocate the necessary resources,such as personnel, technology, infrastructure, and financial support,to establish, implement, maintain, and continuously improve the Information Security Management System (ISMS). These resources should be regularly assessed and adjusted to ensure the ISMS remains effective and aligned with organizational goals."
      },
      {
        "ref_code": "C.7.2",
        "name": "Competence",
        "description": "The organization shall: a) determine the necessary competence of person(s) doing work under its control that affects its information security performance; b) ensure that these persons are competent on the basis of appropriate education, training, or experience; c) where applicable, take actions to acquire the necessary competence, and evaluate the effectiveness of the actions taken; and d) retain appropriate documented information as evidence of competence.",
        "guidance": "The organization should assess the required competencies for personnel involved in information security and ensure they have the necessary skills through education, training, or experience. When gaps are identified, appropriate measures should be taken to enhance competence, such as training programs or hiring qualified personnel. The effectiveness of these actions should be evaluated, and all competency-related information should be documented for compliance and continuous improvement."
      },
      {
        "ref_code": "C.7.3",
        "name": "Awareness",
        "description": "Persons doing work under the organization's control shall be aware of: a) the information security policy; b) their contribution to the effectiveness of the information security management system, including the benefits of improved information security performance; and c) the implications of not conforming with the information security management system requirements.",
        "guidance": "The organization should ensure that all personnel understand the information security policy, their role in maintaining its effectiveness, and the benefits of strong security practices. Employees should also be made aware of the consequences of failing to comply with security requirements. This awareness can be achieved through regular training, clear communication, and reinforcement of security responsibilities."
      },
      {
        "ref_code": "C.7.4",
        "name": "Communication",
        "description": "The organization shall determine the need for internal and external communications relevant to the information security management system including: a) on what to communicate; b) when to communicate; c) with whom to communicate; d) how to communicate.",
        "guidance": "The organization should establish a communication plan for internal and external stakeholders regarding the Information Security Management System (ISMS). This plan should define what security-related information needs to be shared, the timing and frequency of communications, the relevant recipients (e.g., employees, management, partners, or regulators), and the appropriate communication methods (e.g., meetings, reports, emails, or training sessions)."
      },
      {
        "ref_code": "C.7.5",
        "name": "Documented Information",
        "description": "Documented Information mandates establishing and maintaining documented information (records and documents) to support the information security management system (ISMS) and control objectives.",
        "guidance": "Establish and maintain documented information, including policies, procedures, and records, necessary for the effective operation and control of your information security management system (ISMS). Ensure the documented information is readily available, protected, and reviewed regularly. This covers all aspects of your ISMS, from risk assessments to incident responses."
      }
    ]
  },
  {
    "name": "Organizations information security management system shall.",
    "description": "The organization's information security management system shall include: a) documented information required by this document; and b) documented information determined by the organization as being necessary for the effectiveness of the information security management system. 1) the size of organization and its type of activities, processes, products and services; 2) the complexity of processes and their interactions; and 3) the competence of persons.",
    "guidance": "The organization should maintain documented information necessary to meet the requirements of the Information Security Management System (ISMS) and ensure its effectiveness. The extent of documentation should be appropriate to the organization's size, operational complexity, and personnel competence. This includes policies, procedures, risk assessments, security controls, and evidence of compliance, all of which should be regularly reviewed and updated as needed.",
    "ref_code": "C.7.5.1",
    "subcontrols": []
  },
  {
    "name": "Ensure creating and updating.",
    "description": "When creating and updating documented information the organization shall ensure appropriate: a) identification and description (e.g. a title, date, author, or reference number); b) format (e.g. language, software version, graphics) and media (e.g. paper, electronic); and c) review and approval for suitability and adequacy.",
    "guidance": "The organization should ensure that all documented information related to the Information Security Management System (ISMS) is properly identified, formatted, and approved. This includes assigning titles, dates, authors, and reference numbers for easy tracking, maintaining consistency in format and media, and implementing a review and approval process to ensure accuracy, relevance, and adequacy before use.",
    "ref_code": "C.7.5.2",
    "subcontrols": []
  },
  {
    "name": "Control of documented information.",
    "description": "Documented information required by the information security management system and by this document shall be controlled to ensure: a) it is available and suitable for use, where and when it is needed; and b) it is adequately protected (e.g. from loss of confidentiality, improper use, or loss of integrity). For the control of documented information, the organization shall address the following activities, as applicable: c) distribution, access, retrieval and use; d) storage and preservation, including the preservation of legibility; e) control of changes (e.g. version control); and f) retention and disposition. Documented information of external origin, determined by the organization to be necessary for the planning and operation of the information security management system, shall be identified as appropriate, and controlled.",
    "guidance": "The organization should implement controls to ensure that documented information within the Information Security Management System (ISMS) is accessible, accurate, and protected. This includes managing distribution, access, retrieval, and usage while ensuring proper storage, preservation, and version control. Procedures should be in place for handling changes, retention, and secure disposal of documents. Additionally, any external documents relevant to the ISMS should be identified and controlled to maintain consistency and compliance.",
    "ref_code": "C.7.5.3",
    "subcontrols": []
  },
  {
    "name": "Operation control title within iso 27001:2022.",
    "description": "The 'Operation' control title within ISO 27001:2022 focuses on the secure and reliable operation of information processing facilities and the management of system changes.",
    "guidance": "Implement documented procedures for all IT operations, including system startup, shutdown, backups, and routine maintenance.  Regularly monitor system performance and capacity, responding to identified issues and ensuring changes are properly authorized and tested.  Maintain accurate operational logs for audit trails and incident investigation.",
    "ref_code": "C.8",
    "subcontrols": [
      {
        "ref_code": "C.8.1",
        "name": "Operational Planning and Control",
        "description": "The organization shall plan, implement and control the processes needed to meet requirements, and to implement the actions determined in Clause 6, by: , establishing criteria for the processes; , implementing control of the processes in accordance with the criteria. Documented information shall be available to the extent necessary to have confidence that the processes have been carried out as planned. The organization shall control planned changes and review the consequences of unintended changes, taking action to mitigate any adverse effects, as necessary. The organization shall ensure that externally provided processes, products or services that are relevant to the information security management system are controlled.",
        "guidance": "The organization should define clear criteria for its information security processes and implement controls to ensure they operate effectively. Documented information should be maintained to demonstrate that processes are carried out as planned. Any changes, whether planned or unintended, should be reviewed for potential impacts, with corrective actions taken as needed. Additionally, the organization must ensure that externally provided processes, products, or services related to the ISMS are properly controlled to maintain security and compliance."
      },
      {
        "ref_code": "C.8.2",
        "name": "Information Security Risk Assessment",
        "description": "The organization shall perform information security risk assessments at planned intervals or when significant changes are proposed or occur, taking account of the criteria established in 6.1.2 a). The organization shall retain documented information of the results of the information security risk assessments.",
        "guidance": "The organization should conduct information security risk assessments regularly and whenever significant changes occur, ensuring alignment with predefined risk criteria. These assessments should identify, analyze, and evaluate potential security risks. All assessment results must be documented to provide a record of findings, decisions, and actions taken to mitigate risks, supporting continuous improvement and compliance."
      },
      {
        "ref_code": "C.8.3",
        "name": "Information Security Risk Treatment",
        "description": "The organization shall implement the information security risk treatment plan. The organization shall retain documented information of the results of the information security risk treatment.",
        "guidance": "The organization should execute the information security risk treatment plan by applying the selected controls and mitigation measures. The effectiveness of these treatments should be monitored and evaluated. All actions, decisions, and outcomes related to risk treatment must be documented to ensure accountability, track progress, and support continuous improvement of the Information Security Management System (ISMS)."
      }
    ]
  },
  {
    "name": "Performance evaluation.",
    "description": "Performance Evaluation (ISO 27001 2022) requires regularly monitoring and evaluating the effectiveness and efficiency of the information security management system (ISMS) to ensure it achieves its objectives.",
    "guidance": "To evaluate security control performance, establish metrics and regularly monitor them. Analyze data against benchmarks and report on effectiveness, identifying areas for improvement. Use findings to update controls, processes, and risk assessments.",
    "ref_code": "C.9",
    "subcontrols": [
      {
        "ref_code": "C.9.1",
        "name": "Monitoring, Measurement, Analysis, and Evaluation",
        "description": "The organization shall determine: a) what needs to be monitored and measured, including information security processes and controls; b) the methods for monitoring, measurement, analysis and evaluation, as applicable, to ensure valid results. The methods selected should produce comparable and reproducible results to be considered valid; c) when the monitoring and measuring shall be performed; d) who shall monitor and measure; e) when the results from monitoring and measurement shall be analysed and evaluated; f) who shall analyse and evaluate these results. Documented information shall be available as evidence of the results. The organization shall evaluate the information security performance and the effectiveness of the information security management system.",
        "guidance": "The organization should establish a structured approach to monitoring and measuring information security processes and controls. This includes defining what needs to be measured, selecting reliable methods that produce valid results, and determining the timing and responsible personnel for monitoring, analysis, and evaluation. The results should be documented as evidence of performance and used to assess the effectiveness of the Information Security Management System (ISMS), ensuring continuous improvement."
      },
      {
        "ref_code": "C.9.2",
        "name": "Internal Audit",
        "description": "Internal Audit involves planned and independent assessments of the information security management system's effectiveness and compliance to identify areas for improvement.",
        "guidance": "Conduct planned internal audits at least annually to verify the effectiveness of the ISMS and its controls.  Use the audit results to identify and address weaknesses, continually improving the ISMS. Ensure audits are performed by competent and impartial individuals."
      },
      {
        "ref_code": "C.9.3",
        "name": "Management Review",
        "description": "Management Review requires the organization to regularly review its information security management system's effectiveness, addressing identified issues and opportunities for improvement.",
        "guidance": "To implement the \"Management Review\" control, establish a documented process for regularly reviewing the ISMS's effectiveness.  This includes scheduling reviews, gathering relevant data, and ensuring management actively participates to assess performance, identify improvements, and allocate necessary resources.  Document review findings, actions, and responsibilities for accountability and continuous improvement."
      }
    ]
  },
  {
    "name": "Organization shall conduct internal audits at.",
    "description": "The organization shall conduct internal audits at planned intervals to provide information on whether the information security management system: a) conforms to 1) the organization's own requirements for its information security management system; 2) the requirements of this document; b) is effectively implemented and maintained.",
    "guidance": "The organization should schedule and conduct internal audits at regular intervals to assess whether the Information Security Management System (ISMS) complies with internal policies and external requirements. These audits should evaluate the effectiveness of ISMS implementation and maintenance. Findings should be documented, and any necessary corrective actions should be taken to ensure continuous improvement and compliance.",
    "ref_code": "C.9.2.1",
    "subcontrols": []
  },
  {
    "name": "Internal audit program.",
    "description": "The organization shall plan, establish, implement and maintain an audit program(s), including the frequency, methods, responsibilities, planning requirements and reporting. When establishing the internal audit program(s), the organization shall consider the importance of the processes concerned and the results of previous audits. The organization shall: a) define the audit criteria and scope for each audit; b) select auditors and conduct audits that ensure objectivity and the impartiality of the audit process; c) ensure that the results of the audits are reported to relevant management; Documented information shall be available as evidence of the implementation of the audit program(s) and the audit results.",
    "guidance": "The organization should develop and maintain an internal audit program that defines the frequency, methods, responsibilities, and reporting requirements. When planning audits, the organization must consider the importance of specific processes and past audit results. Audit criteria and scope should be clearly defined, and auditors should be selected to ensure objectivity and impartiality. Audit findings must be reported to relevant management, and all audit activities and results should be documented as evidence of compliance and continuous improvement.",
    "ref_code": "C.9.2.2",
    "subcontrols": []
  },
  {
    "name": "Top management shall review organizations information.",
    "description": "Top management shall review the organization's information security management system at planned intervals to ensure its continuing suitability, adequacy and effectiveness.",
    "guidance": "Top management should conduct periodic reviews of the Information Security Management System (ISMS) to assess its suitability, adequacy, and effectiveness. These reviews should evaluate performance metrics, audit results, security incidents, and any necessary improvements. Findings and decisions from the review should be documented, and necessary actions should be taken to enhance the ISMS and align it with organizational goals.",
    "ref_code": "C.9.3.1",
    "subcontrols": []
  },
  {
    "name": "Management review inputs.",
    "description": "The management review shall include consideration of: a) the status of actions from previous management reviews; b) changes in external and internal issues that are relevant to the information security management system; c) changes in needs and expectations of interested parties that are relevant to the information security management system; d) feedback on the information security performance, including trends in: 1) nonconformities and corrective actions; 2) monitoring and measurement results; 3) audit results; 4) fulfilment of information security objectives; e) feedback from interested parties; f) results of risk assessment and status of risk treatment plan; g) opportunities for continual improvement.",
    "guidance": "The management review should assess the effectiveness of the Information Security Management System (ISMS) by considering the status of previous actions, changes in internal and external factors, and evolving stakeholder expectations. It should include an analysis of security performance trends, such as nonconformities, corrective actions, audit findings, and progress toward security objectives. Additionally, feedback from interested parties, risk assessment results, and opportunities for continuous improvement should be reviewed. All findings and decisions should be documented to guide future security enhancements.",
    "ref_code": "C.9.3.2",
    "subcontrols": []
  },
  {
    "name": "Management review outputs.",
    "description": "The results of the management review shall include decisions related to continual improvement opportunities and any needs for changes to the information security management system. Documented information shall be available as evidence of the results of management reviews.",
    "guidance": "The management review should result in decisions aimed at enhancing the Information Security Management System (ISMS), including identifying opportunities for continual improvement and necessary changes. All outcomes, including action items and planned adjustments, should be documented as evidence of the review process. This documentation ensures accountability and supports the ongoing effectiveness of the ISMS.",
    "ref_code": "C.9.3.3",
    "subcontrols": []
  },
  {
    "name": "Improvement control focuses on continual enhancement.",
    "description": "The 'Improvement' control focuses on the continual enhancement of the information security management system (ISMS) to address vulnerabilities, adapt to changes, and increase its effectiveness over time.",
    "guidance": "Implement a continual improvement process. Establish a mechanism to identify, assess, and prioritize improvement opportunities based on performance monitoring, audits, and feedback. Regularly review and update the ISMS based on these identified improvements and any changes in the internal or external context.",
    "ref_code": "C.10",
    "subcontrols": [
      {
        "ref_code": "C.10.1",
        "name": "Continual Improvement",
        "description": "The organization shall continually improve the suitability, adequacy and effectiveness of the information security management system.",
        "guidance": "The organization should regularly evaluate and update its Information Security Management System (ISMS) to enhance its suitability, adequacy, and effectiveness. Feedback from audits, risk assessments, and management reviews should be used to identify improvement opportunities and implement necessary corrective actions. All improvements and adjustments must be documented to ensure transparency and accountability."
      },
      {
        "ref_code": "C.10.2",
        "name": "Nonconformity and Corrective Action",
        "description": "When a nonconformity occurs, the organization shall: a) react to the nonconformity, and as applicable: 1) take action to control and correct it; 2) deal with the consequences; b) evaluate the need for action to eliminate the causes of nonconformity, in order that it does not recur or occur elsewhere, by: 1) reviewing the nonconformity; 2) determining the causes of the nonconformity; and 3) determining if similar nonconformities exist, or could potentially occur; c) implement any action needed; d) review the effectiveness of any corrective action taken; and e) make changes to the information security management system, if necessary. Corrective actions shall be appropriate to the effects of the nonconformities encountered. Documented information shall be available as evidence of: f) the nature of the nonconformities and any subsequent actions taken, g) the results of any corrective action.",
        "guidance": "The organization should respond to nonconformities by taking immediate action to control and correct the issue while addressing any consequences. A thorough evaluation should be conducted to determine the root cause and assess whether similar issues exist or could arise. Necessary corrective actions should be implemented, their effectiveness reviewed, and adjustments made to the Information Security Management System (ISMS) if required. All nonconformities, actions taken, and results should be documented as evidence of compliance and continuous improvement."
      }
    ]
  },
  {
    "name": "Organizational controls.",
    "description": "Organizational Controls encompass the establishment of a management framework and supporting structures to support and sustain information security management.",
    "guidance": "This control emphasizes establishing and maintaining organizational structures that support information security. Implement clear roles, responsibilities, and reporting lines for security activities. Ensure management commitment and oversight, including defining security policies and procedures.",
    "ref_code": "A.5",
    "subcontrols": [
      {
        "ref_code": "A.5.1",
        "name": "Policies for Information Security",
        "description": "Information security policy and topic-specific policies shall be defined, approved by management, published, communicated to and acknowledged by relevant personnel and relevant interested parties, and reviewed at planned intervals and if significant changes occur.",
        "guidance": "The organization should establish and document an information security policy along with any necessary topic-specific policies. These policies must be formally approved by management, communicated to all relevant personnel and stakeholders, and acknowledged by those responsible for compliance. Regular reviews should be conducted at planned intervals or whenever significant changes occur to ensure policies remain relevant and effective."
      },
      {
        "ref_code": "A.5.2",
        "name": "Information Security Roles and Responsibilities",
        "description": "Information security roles and responsibilities shall be defined and allocated according to the organization needs.",
        "guidance": "The organization should clearly define and assign information security roles and responsibilities based on its specific needs. This ensures that all security-related tasks are properly managed and that individuals understand their duties in protecting information assets. These roles should be regularly reviewed and updated as necessary to maintain the effectiveness of the Information Security Management System (ISMS)."
      },
      {
        "ref_code": "A.5.3",
        "name": "Segregation of Duties",
        "description": "Conflicting duties and conflicting areas of responsibility shall be segregated.",
        "guidance": "The organization should implement segregation of duties to prevent conflicts of interest and reduce the risk of fraud, errors, or unauthorized actions. Responsibilities should be assigned so that no single individual has control over multiple critical aspects of a security process. Regular reviews should be conducted to ensure that segregation remains effective and aligns with security and compliance requirements."
      },
      {
        "ref_code": "A.5.4",
        "name": "Management Responsibilities",
        "description": "Management shall require all personnel to apply information security in accordance with the established information security policy, topic-specific policies and procedures of the organization.",
        "guidance": "Management should ensure that all personnel adhere to the organization's information security policy, topic-specific policies, and procedures. This can be achieved through regular training, clear communication of security expectations, and enforcement of security controls. Compliance should be monitored, and corrective actions should be taken when necessary to maintain a strong security culture."
      },
      {
        "ref_code": "A.5.5",
        "name": "Contact with Authorities",
        "description": "The organization shall establish and maintain contact with relevant authorities.",
        "guidance": "The organization should identify and establish communication channels with relevant authorities, such as regulatory bodies, law enforcement, and industry compliance organizations. Maintaining these relationships ensures timely access to legal, regulatory, and security-related information, facilitating compliance and effective incident response when needed."
      },
      {
        "ref_code": "A.5.6",
        "name": "Contact with Special Interest Groups",
        "description": "The organization shall establish and maintain contact with special interest groups or other specialist security forums and professional associations.",
        "guidance": "The organization should engage with special interest groups, security forums, and professional associations to stay informed about emerging threats, best practices, and industry trends. Participation in these groups enhances knowledge sharing, collaboration, and continuous improvement of the organization's information security posture."
      },
      {
        "ref_code": "A.5.7",
        "name": "Threat Intelligence",
        "description": "Information relating to information security threats shall be collected and analyzed to produce threat intelligence.",
        "guidance": "The organization should actively gather and analyze information on potential security threats from internal and external sources. This threat intelligence should be used to assess risks, anticipate vulnerabilities, and implement proactive security measures. Regular updates and monitoring should ensure that the organization remains prepared for evolving threats."
      },
      {
        "ref_code": "A.5.8",
        "name": "Information Security in Project Management",
        "description": "Information security shall be integrated into project management.",
        "guidance": "The organization should incorporate information security considerations into all phases of project management, ensuring that security risks are identified and addressed from the outset. Security requirements should be embedded in project planning, development, and execution to protect information assets and maintain compliance with security policies and standards."
      },
      {
        "ref_code": "A.5.9",
        "name": "Inventory of Information and Other Associated Assets",
        "description": "An inventory of information and other associated assets, including owners, shall be developed and maintained.",
        "guidance": "The organization should create and maintain an up-to-date inventory of all information assets and associated resources, including data, hardware, software, and critical infrastructure. Each asset should have a designated owner responsible for its security and management. Regular reviews and updates should be conducted to ensure accuracy and proper risk management."
      },
      {
        "ref_code": "A.5.10",
        "name": "Acceptable Use of Information and Other Associated Assets",
        "description": "Rules for the acceptable use and procedures for handling information and other associated assets shall be identified, documented and implemented.",
        "guidance": "The organization should define and document rules for the acceptable use and handling of information and associated assets. These rules should outline permissible activities, security requirements, and restrictions to prevent misuse or unauthorized access. Employees and relevant stakeholders should be informed of these policies, and compliance should be monitored and enforced."
      },
      {
        "ref_code": "A.5.11",
        "name": "Return of Assets",
        "description": "Personnel and other interested parties as appropriate shall return all the organization's assets in their possession upon change or termination of their employment, contract or agreement.",
        "guidance": "The organization should implement a formal process to ensure that all personnel and relevant third parties return organizational assets upon termination or role change. This includes hardware, software, access credentials, and any sensitive information. Asset recovery should be documented, and access to systems should be revoked to prevent unauthorized use or data breaches."
      },
      {
        "ref_code": "A.5.12",
        "name": "Classification of Information",
        "description": "Information shall be classified according to the information security needs of the organization based on confidentiality, integrity, availability and relevant interested party requirements.",
        "guidance": "The organization should establish an information classification system based on confidentiality, integrity, availability, and stakeholder requirements. This classification should define how data is handled, stored, and shared according to its sensitivity and business impact. Employees should be trained on classification guidelines, and enforcement mechanisms should be implemented to ensure compliance."
      },
      {
        "ref_code": "A.5.13",
        "name": "Labelling of Information",
        "description": "An appropriate set of procedures for information labelling shall be developed and implemented in accordance with the information classification scheme adopted by the organization.",
        "guidance": "The organization should develop and implement procedures for labeling information based on its classification scheme. Labels should indicate the sensitivity of the information and guide proper handling, storage, and sharing. These procedures should be consistently applied across all formats and communicated to employees to ensure compliance with security requirements."
      },
      {
        "ref_code": "A.5.14",
        "name": "Information Transfer",
        "description": "Information transfer rules, procedures, or agreements shall be in place for all types of transfer facilities within the organization and between the organization and other parties.",
        "guidance": "The organization should establish and enforce rules, procedures, or agreements for securely transferring information both internally and externally. These measures should define acceptable transfer methods, encryption requirements, access controls, and responsibilities to prevent unauthorized access, data loss, or breaches. Employees and third parties should be informed of these requirements to ensure compliance."
      },
      {
        "ref_code": "A.5.15",
        "name": "Access Control",
        "description": "Rules to control physical and logical access to information and other associated assets shall be established and implemented based on business and information security requirements.",
        "guidance": "The organization should define and implement rules for controlling both physical and logical access to information and assets based on business and security requirements. These controls should ensure that only authorized personnel have access to sensitive information, systems, and facilities. Access rights should be regularly reviewed, updated as necessary, and enforced through authentication mechanisms, role-based permissions, and physical security measures."
      },
      {
        "ref_code": "A.5.16",
        "name": "Identity Management",
        "description": "The full life cycle of identities shall be managed.",
        "guidance": "The organization should implement an identity management process that covers the entire lifecycle of user identities, from creation to deactivation. This includes provisioning access based on role requirements, regularly reviewing and updating permissions, and promptly revoking access when it is no longer needed. Strong authentication and monitoring mechanisms should be in place to prevent unauthorized access and ensure compliance with security policies."
      },
      {
        "ref_code": "A.5.17",
        "name": "Authentication Information",
        "description": "Allocation and management of authentication information shall be controlled by a management process, including advising personnel on appropriate handling of authentication information.",
        "guidance": "The organization should establish a formal process for managing authentication information, such as passwords, multi-factor authentication tokens, and cryptographic keys. This process should include secure generation, distribution, storage, and revocation of authentication credentials. Personnel should be trained on best practices for handling authentication information, including avoiding password reuse, recognizing phishing attempts, and securely storing credentials. Regular audits and enforcement mechanisms should be implemented to ensure compliance."
      },
      {
        "ref_code": "A.5.18",
        "name": "Access Rights",
        "description": "Access rights to information and other associated assets shall be provisioned, reviewed, modified and removed in accordance with the organization's topic-specific policy on and rules for access control.",
        "guidance": "The organization should implement a structured access management process to ensure that access rights to information and assets are granted, reviewed, modified, and revoked based on business needs and security policies. Regular access reviews should be conducted to prevent unauthorized access, and access should be promptly removed when no longer required. This process should be documented, monitored, and enforced to maintain compliance with security requirements."
      },
      {
        "ref_code": "A.5.19",
        "name": "Information Security in Supplier Relationships",
        "description": "Processes and procedures shall be defined and implemented to manage the information security risks associated with the use of supplier's products or services.",
        "guidance": "The organization should establish and implement processes to assess and manage information security risks associated with suppliers' products and services. This includes conducting security due diligence, defining security requirements in contracts, monitoring supplier compliance, and regularly reviewing supplier relationships. Risk assessments should be performed periodically to ensure that third-party engagements do not introduce vulnerabilities to the organization's information security posture."
      },
      {
        "ref_code": "A.5.20",
        "name": "Addressing Information Security Within Supplier Agreements",
        "description": "Relevant information security requirements shall be established and agreed with each supplier based on the type of supplier relationship.",
        "guidance": "The organization should define and document security requirements for each supplier based on the nature of the relationship and the level of access to sensitive information. These requirements should be formally agreed upon through contracts or service agreements and should cover areas such as data protection, compliance obligations, incident response, and access controls. Regular monitoring and audits should be conducted to ensure suppliers adhere to the agreed security standards."
      },
      {
        "ref_code": "A.5.21",
        "name": "Managing Information Security in the ICT Supply Chain",
        "description": "Processes and procedures shall be defined and implemented to manage the information security risks associated with the ICT products and services supply chain.",
        "guidance": "The organization should establish and implement processes to identify, assess, and mitigate information security risks within the ICT supply chain. This includes evaluating vendors, defining security requirements in contracts, monitoring compliance, and ensuring secure handling of data and systems throughout the supply chain. Regular assessments and audits should be conducted to address emerging risks and maintain the integrity of ICT products and services."
      },
      {
        "ref_code": "A.5.22",
        "name": "Monitoring, Review, and Change Management of Supplier Services",
        "description": "The organization shall regularly monitor, review, evaluate and manage change in supplier information security practices and service delivery.",
        "guidance": "The organization should implement a process to continuously monitor and assess supplier security practices and service delivery. This includes conducting regular reviews, audits, and performance evaluations to ensure compliance with agreed security requirements. Any changes in supplier security controls or service provisions should be evaluated for potential risks, and necessary adjustments should be made to maintain the organization's security posture."
      },
      {
        "ref_code": "A.5.23",
        "name": "Information Security for Use of Cloud Services",
        "description": "Processes for acquisition, use, management and exit from cloud services shall be established in accordance with the organization's information security requirements.",
        "guidance": "The organization should define and implement processes for the secure acquisition, usage, management, and termination of cloud services. These processes should align with information security requirements, covering aspects such as data protection, access controls, compliance obligations, and incident response. Regular assessments should be conducted to ensure cloud providers meet security standards, and exit strategies should be in place to ensure secure data migration or deletion when discontinuing cloud services."
      },
      {
        "ref_code": "A.5.24",
        "name": "Information Security Incident Management Planning and Preparation",
        "description": "The organization shall plan and prepare for managing information security incidents by defining, establishing and communicating information security incident management processes, roles and responsibilities.",
        "guidance": "The organization should develop and implement a structured incident management process that defines how security incidents are identified, reported, and resolved. Clear roles and responsibilities should be assigned to ensure timely response and mitigation. This process should be documented, communicated to relevant personnel, and regularly tested through simulations or drills to ensure preparedness for potential security incidents."
      },
      {
        "ref_code": "A.5.25",
        "name": "Assessment and Decision on Information Security Events",
        "description": "The organization shall assess information security events and decide if they are to be categorized as information security incidents.",
        "guidance": "The organization should establish a process to evaluate security events and determine whether they qualify as security incidents. This assessment should be based on predefined criteria, considering factors such as impact, scope, and severity. Clear guidelines should be in place to ensure timely identification, classification, and appropriate response to potential threats. All assessments and decisions should be documented for accountability and continuous improvement."
      },
      {
        "ref_code": "A.5.26",
        "name": "Response to Information Security Incidents",
        "description": "Information security incidents shall be responded to in accordance with the documented procedures.",
        "guidance": "The organization should ensure that all information security incidents are handled according to predefined and documented response procedures. These procedures should outline steps for containment, investigation, mitigation, communication, and recovery. Incident response activities should be logged, reviewed, and analyzed to improve future responses and strengthen the organization's security posture."
      },
      {
        "ref_code": "A.5.27",
        "name": "Learning from Information Security Incidents",
        "description": "Knowledge gained from information security incidents shall be used to strengthen and improve the information security controls.",
        "guidance": "The organization should analyze information security incidents to identify root causes, vulnerabilities, and weaknesses in existing controls. Lessons learned should be used to enhance security policies, procedures, and technologies to prevent similar incidents in the future. Continuous improvement efforts should be documented and communicated to relevant stakeholders to strengthen the overall security posture."
      },
      {
        "ref_code": "A.5.28",
        "name": "Collection of Evidence",
        "description": "The organization shall establish and implement procedures for the identification, collection, acquisition and preservation of evidence related to information security events.",
        "guidance": "The organization should develop and implement procedures for identifying, collecting, acquiring, and preserving evidence related to information security events. These procedures should ensure that evidence is handled securely, maintaining its integrity and chain of custody for forensic investigations or legal purposes. Personnel involved in incident response should be trained on proper evidence management to support regulatory compliance and incident resolution."
      },
      {
        "ref_code": "A.5.29",
        "name": "Information Security During Disruption",
        "description": "The organization shall plan how to maintain information security at an appropriate level during disruption.",
        "guidance": "The organization should develop a business continuity plan that includes strategies for maintaining information security during disruptions. This plan should identify critical systems, establish backup and recovery procedures, and define roles and responsibilities for incident response. Regular testing and updates should be conducted to ensure the plan remains effective in mitigating security risks during unexpected events."
      },
      {
        "ref_code": "A.5.30",
        "name": "ICT Readiness for Business Continuity",
        "description": "ICT readiness shall be planned, implemented, maintained and tested based on business continuity objectives and ICT continuity requirements.",
        "guidance": "The organization should develop and implement an ICT continuity plan that aligns with business continuity objectives and security requirements. This plan should include strategies for maintaining critical ICT systems, backup and recovery procedures, and incident response measures. Regular testing and updates should be conducted to ensure ICT readiness and resilience against disruptions."
      },
      {
        "ref_code": "A.5.31",
        "name": "Legal, Statutory, Regulatory, and Contractual Requirements",
        "description": "Legal, statutory, regulatory and contractual requirements relevant to information security and the organization's approach to meet these requirements shall be identified, documented and kept up to date.",
        "guidance": "The organization should identify all legal, statutory, regulatory, and contractual requirements related to information security and document how they are met. These requirements should be regularly reviewed and updated to ensure ongoing compliance. Compliance measures should be integrated into policies, procedures, and security controls, with periodic audits conducted to verify adherence."
      },
      {
        "ref_code": "A.5.32",
        "name": "Intellectual Property Rights",
        "description": "The organization shall implement appropriate procedures to protect intellectual property rights.",
        "guidance": "The organization should establish and enforce procedures to safeguard intellectual property rights, including trademarks, copyrights, patents, and proprietary information. These procedures should ensure proper authorization for the use of intellectual property, prevent unauthorized distribution or reproduction, and include measures for detecting and responding to potential infringements. Employees and third parties should be made aware of these policies to ensure compliance."
      },
      {
        "ref_code": "A.5.33",
        "name": "Protection of Records",
        "description": "Records shall be protected from loss, destruction, falsification, unauthorized access and unauthorized release.",
        "guidance": "The organization should implement controls to ensure the security and integrity of records by protecting them from loss, destruction, falsification, unauthorized access, and unauthorized release. This includes using access controls, encryption, backups, and secure storage solutions. Regular audits and monitoring should be conducted to verify compliance with security policies and regulatory requirements."
      },
      {
        "ref_code": "A.5.34",
        "name": "Privacy and Protection of Personally Identifiable Information (PII)",
        "description": "The organization shall identify and meet the requirements regarding the preservation of privacy and protection of PII according to applicable laws and regulations and contractual requirements.",
        "guidance": "The organization should identify all applicable legal, regulatory, and contractual requirements related to privacy and the protection of personally identifiable information (PII). Policies and controls should be implemented to ensure compliance, including data minimization, secure storage, access restrictions, and encryption. Regular audits and assessments should be conducted to verify adherence and address any privacy risks."
      },
      {
        "ref_code": "A.5.35",
        "name": "Independent Review of Information Security",
        "description": "The organization's approach to managing information security and its implementation including people, processes and technologies shall be reviewed independently at planned intervals, or when significant changes occur.",
        "guidance": "The organization should conduct independent reviews of its information security management system (ISMS) at planned intervals or when significant changes occur. These reviews should assess the effectiveness of security policies, processes, and technologies, ensuring they align with organizational objectives and regulatory requirements. Findings should be documented, and necessary improvements should be implemented to enhance overall security posture."
      },
      {
        "ref_code": "A.5.36",
        "name": "Compliance with Policies, Rules, and Standards for Information Security",
        "description": "Compliance with the organization's information security policy, topic-specific policies, rules and standards shall be regularly reviewed.",
        "guidance": "The organization should conduct regular reviews to ensure compliance with its information security policy, topic-specific policies, rules, and standards. These reviews should include audits, assessments, and monitoring activities to identify gaps or areas for improvement. Any noncompliance issues should be addressed through corrective actions to maintain a strong security posture and regulatory adherence."
      },
      {
        "ref_code": "A.5.37",
        "name": "Documented operating procedures",
        "description": "Operating procedures for information processing facilities shall be documented and made available to personnel who need them.",
        "guidance": "The organization should document operating procedures for information processing facilities to ensure consistency, security, and efficiency. These procedures should be accessible to authorized personnel who require them for their roles. Regular reviews and updates should be conducted to keep the documentation accurate and aligned with evolving security and operational requirements."
      }
    ]
  },
  {
    "name": "People controls.",
    "description": "People Controls encompass the security measures focused on managing, educating, and ensuring the trustworthiness and competence of individuals, including employees, contractors, and third-party users, to minimize human-related security risks.",
    "guidance": "Implement people controls by establishing and enforcing robust security awareness training programs, conducting thorough background checks, and clearly defining security responsibilities within job descriptions and contracts. This ensures employees understand their roles in protecting information assets. Regularly assess and update these controls to adapt to evolving threats and personnel changes.",
    "ref_code": "A.6",
    "subcontrols": [
      {
        "ref_code": "A.6.1",
        "name": "Screening",
        "description": "Background verification checks on all candidates to become personnel shall be carried out prior to joining the organization and on an ongoing basis taking into consideration applicable laws, regulations and ethics and be proportional to the business requirements, the classification of the information to be accessed and the perceived risks.",
        "guidance": "The organization should conduct background verification checks on all candidates before they join and continue these checks as necessary throughout their tenure. These checks should comply with applicable laws, regulations, and ethical considerations while being proportional to business needs, the sensitivity of information accessed, and associated risks. The process should be documented, consistently applied, and periodically reviewed to ensure effectiveness and compliance."
      },
      {
        "ref_code": "A.6.2",
        "name": "Terms and Conditions of Employment",
        "description": "The employment contractual agreements shall state the personnel's and the organization's responsibilities for information security.",
        "guidance": "The organization should ensure that employment contracts explicitly outline both personnel and organizational responsibilities for information security. These agreements should cover confidentiality obligations, acceptable use of assets, compliance with security policies, and consequences for violations. Contracts should be reviewed periodically and updated as needed to align with evolving security and regulatory requirements."
      },
      {
        "ref_code": "A.6.3",
        "name": "Information Security Awareness, Education and Training",
        "description": "Personnel of the organization and relevant interested parties shall receive appropriate information security awareness, education and training and regular updates of the organization's information security policy, topic-specific policies and procedures, as relevant for their job function.",
        "guidance": "The organization should provide ongoing information security awareness, education, and training to all personnel and relevant stakeholders. Training programs should be tailored to job roles, covering security policies, procedures, and best practices. Regular updates should be conducted to keep personnel informed of emerging threats, policy changes, and compliance requirements, ensuring a strong security culture within the organization."
      },
      {
        "ref_code": "A.6.4",
        "name": "Disciplinary Process",
        "description": "A disciplinary process shall be formalized and communicated to take actions against personnel and other relevant interested parties who have committed an information security policy violation.",
        "guidance": "The organization should establish a formal disciplinary process to address information security policy violations. This process should be clearly documented, communicated to all personnel, and applied consistently. It should outline the types of violations, potential consequences, and corrective actions, ensuring accountability and reinforcing a culture of security compliance."
      },
      {
        "ref_code": "A.6.5",
        "name": "Responsibilities After Termination or Change of Employment",
        "description": "Information security responsibilities and duties that remain valid after termination or change of employment shall be defined, enforced and communicated to relevant personnel and other interested parties.",
        "guidance": "The organization should define and enforce information security responsibilities that continue after an employee's termination or role change. These responsibilities should be clearly documented in policies, contracts, or agreements and communicated to relevant personnel and stakeholders. Measures should be in place to ensure compliance, such as non-disclosure agreements and restrictions on data retention or access after departure."
      },
      {
        "ref_code": "A.6.6",
        "name": "Confidentiality or  Non-Disclosure Agreements",
        "description": "Confidentiality or non-disclosure agreements reflecting the organization's needs for the protection of information shall be identified, documented, regularly reviewed and signed by personnel and other relevant interested parties.",
        "guidance": "The organization should require personnel and relevant third parties to sign confidentiality or non-disclosure agreements (NDAs) that align with its information protection needs. These agreements should be clearly documented, regularly reviewed for relevance and compliance, and enforced to ensure that sensitive information remains protected both during and after employment or contractual engagements."
      },
      {
        "ref_code": "A.6.7",
        "name": "Remote Working",
        "description": "Security measures shall be implemented when personnel are working remotely to protect information accessed, processed or stored outside the organization's premises.",
        "guidance": "The organization should implement security measures to protect information when personnel work remotely. This includes enforcing secure access controls, using encrypted connections (e.g., VPNs), ensuring endpoint security, and establishing clear remote work policies. Regular training and monitoring should be conducted to mitigate risks associated with remote access and data handling outside the organization's premises."
      },
      {
        "ref_code": "A.6.8",
        "name": "Information Security Event Reporting",
        "description": "The organization shall provide a mechanism for personnel to report observed or suspected information security events through appropriate channels in a timely manner.",
        "guidance": "The organization should establish a clear and accessible mechanism for personnel to report observed or suspected information security events promptly. This can include a dedicated reporting system, hotline, or designated security contact. Reporting procedures should be well-communicated, encourage timely reporting without fear of retaliation, and ensure that incidents are properly logged, assessed, and addressed to minimize security risks."
      }
    ]
  },
  {
    "name": "Physical controls.",
    "description": "Physical Controls, a crucial component of ISO 27001, focuses on securing physical assets and environments from unauthorized access, damage, and disruption.",
    "guidance": "Implement physical access controls like secure doors, locks, and visitor management systems to restrict unauthorized entry.  Establish environmental controls such as fire suppression and power backup to protect assets. Regularly inspect and maintain physical security measures to ensure their effectiveness.",
    "ref_code": "A.7",
    "subcontrols": [
      {
        "ref_code": "A.7.1",
        "name": "Physical Security Perimeters",
        "description": "Security perimeters shall be defined and used to protect areas that contain information and other associated assets.",
        "guidance": "The organization should establish and enforce security perimeters to protect areas containing information and associated assets. This includes implementing physical barriers, access controls, surveillance, and monitoring systems to prevent unauthorized access. Security perimeters should be regularly reviewed and adjusted based on risk assessments and evolving security threats."
      },
      {
        "ref_code": "A.7.2",
        "name": "Physical Entry",
        "description": "Secure areas shall be protected by appropriate entry controls and access points.",
        "guidance": "The organization should implement appropriate entry controls and access management measures to secure designated areas. This includes using key cards, biometric authentication, security guards, or other physical access controls to restrict entry to authorized personnel only. Access logs should be maintained, and periodic reviews should be conducted to ensure security measures remain effective."
      },
      {
        "ref_code": "A.7.3",
        "name": "Securing Offices, Rooms and Facilities",
        "description": "Physical security for offices, rooms and facilities shall be designed and implemented.",
        "guidance": "The organization should design and implement physical security measures to protect offices, rooms, and facilities from unauthorized access, theft, and environmental hazards. This includes access controls, surveillance systems, alarm systems, secure storage areas, and emergency response protocols. Security measures should be regularly reviewed and updated to address emerging threats and changing operational needs."
      },
      {
        "ref_code": "A.7.4",
        "name": "Physical Security Monitoring",
        "description": "Premises shall be continuously monitored for unauthorized physical access.",
        "guidance": "The organization should implement continuous monitoring of premises to detect and prevent unauthorized physical access. This can include surveillance cameras, intrusion detection systems, security guards, and access logs. Monitoring data should be regularly reviewed, and incidents should be promptly investigated to maintain a secure environment."
      },
      {
        "ref_code": "A.7.5",
        "name": "Protecting Against Physical and Environmental Threats",
        "description": "Protection against physical and environmental threats, such as natural disasters and other intentional or unintentional physical threats to infrastructure shall be designed and implemented.",
        "guidance": "The organization should establish and implement protective measures against physical and environmental threats, including natural disasters, vandalism, theft, and accidental damage. This may include fire suppression systems, flood protection, backup power supplies, reinforced infrastructure, and security monitoring. Risk assessments should be conducted regularly to ensure these protections remain effective and aligned with evolving threats."
      },
      {
        "ref_code": "A.7.6",
        "name": "Working in Secure Areas",
        "description": "Security measures for working in secure areas shall be designed and implemented.",
        "guidance": "The organization should establish and enforce security measures for personnel working in secure areas. These measures may include strict access controls, surveillance monitoring, visitor restrictions, and guidelines for handling sensitive information. Secure areas should be regularly assessed for vulnerabilities, and security protocols should be updated as needed to maintain protection."
      },
      {
        "ref_code": "A.7.7",
        "name": "Clear Desk and Clear Screen",
        "description": "Clear desk rules for papers and removable storage media and clear screen rules for informati",
        "guidance": "The organization should implement and enforce clear desk and clear screen policies to protect sensitive information. Employees should ensure that papers, removable storage media, and other confidential materials are securely stored when not in use. Likewise, computer screens should be locked or logged out when unattended. Regular awareness training and monitoring should be conducted to reinforce compliance with these policies."
      },
      {
        "ref_code": "A.7.8",
        "name": "Equipment Siting and Protection",
        "description": "Equipment shall be sited securely and protected.",
        "guidance": "The organization should ensure that equipment is securely located and protected from unauthorized access, environmental hazards, theft, and damage. This includes placing critical hardware in restricted areas, using physical locks, implementing climate control measures, and securing network infrastructure. Regular inspections and risk assessments should be conducted to maintain equipment security."
      },
      {
        "ref_code": "A.7.9",
        "name": "Security of Assets Off-Premises",
        "description": "Off-site assets shall be protected.",
        "guidance": "The organization should implement security measures to protect off-site assets, including laptops, mobile devices, and portable storage media. This may include encryption, remote tracking, access controls, and secure storage guidelines. Employees should be trained on proper handling and security practices to prevent loss, theft, or unauthorized access to off-site assets."
      },
      {
        "ref_code": "A.7.10",
        "name": "Storage Media",
        "description": "Storage media shall be managed through their life cycle of acquisition, use, transportation and disposal in accordance with the organization's classification scheme and handling requirements.",
        "guidance": "The organization should establish and enforce procedures for managing storage media throughout its lifecycle, from acquisition and use to transportation and secure disposal. This includes classifying media based on sensitivity, implementing encryption and access controls, securely transporting data, and ensuring proper sanitization or destruction before disposal. Regular audits and compliance checks should be conducted to maintain security and prevent unauthorized access or data breaches."
      },
      {
        "ref_code": "A.7.11",
        "name": "Supporting Utilities",
        "description": "Information processing facilities shall be protected from power failures and other disruptions caused by failures in supporting utilities.",
        "guidance": "The organization should implement measures to protect information processing facilities from power failures and utility disruptions. This includes using uninterruptible power supplies (UPS), backup generators, redundant network connections, and environmental monitoring systems. Regular testing and maintenance should be conducted to ensure these protections remain effective and minimize downtime risks."
      },
      {
        "ref_code": "A.7.12",
        "name": "Cabling Security",
        "description": "Cables carrying power, data or supporting information services shall be protected from interception, interference or damage.",
        "guidance": "The organization should implement protective measures to secure cables carrying power, data, and supporting information services from interception, interference, or damage. This includes using conduit enclosures, shielding, secured routing paths, and regular inspections to detect tampering or wear. Proper cable management should be enforced to minimize security risks and ensure reliable operations."
      },
      {
        "ref_code": "A.7.13",
        "name": "Equipment Maintenance",
        "description": "Equipment shall be maintained correctly to ensure availability, integrity and confidentiality of information.",
        "guidance": "The organization should establish a maintenance program to ensure that all equipment is regularly inspected, updated, and serviced to maintain availability, integrity, and confidentiality of information. Maintenance procedures should include scheduled servicing, firmware and software updates, security patching, and compliance checks. Access to maintenance activities should be restricted to authorized personnel, and logs should be maintained for accountability."
      },
      {
        "ref_code": "A.7.14",
        "name": "Secure Disposal or Re-Use of Equipment",
        "description": "Items of equipment containing storage media shall be verified to ensure that any sensitive data and licensed software has been removed or securely overwritten prior to disposal or re-use.",
        "guidance": "The organization should implement a secure data sanitization process to ensure that all sensitive data and licensed software are removed or securely overwritten before disposing of or reusing equipment containing storage media. This may include data-wiping software, degaussing, or physical destruction, depending on the sensitivity of the information. Proper documentation and verification should be maintained to ensure compliance with security policies and regulatory requirements."
      }
    ]
  },
  {
    "name": "Technological controls.",
    "description": "Technological controls encompass the use of technology to protect information assets and systems, including access control, malware protection, and data encryption.",
    "guidance": "Implement technological controls by incorporating security features within IT systems, such as access controls, encryption, and malware protection, to protect information assets. Regularly review and update these controls to adapt to evolving threats and maintain the effectiveness of your security posture.  Automate where possible to improve efficiency and reduce human error.",
    "ref_code": "A.8",
    "subcontrols": [
      {
        "ref_code": "A.8.1",
        "name": "User End Point Devices",
        "description": "Information stored on, processed by or accessible via user end point devices shall be protected.",
        "guidance": "The organization should implement security measures to protect information stored on, processed by, or accessible via user endpoint devices. This includes enforcing encryption, access controls, endpoint detection and response (EDR), secure configuration settings, and regular software updates. Users should be trained on security best practices, and remote wipe capabilities should be enabled for lost or stolen devices."
      },
      {
        "ref_code": "A.8.2",
        "name": "Privileged Access Rights",
        "description": "The allocation and use of privileged access rights shall be restricted and managed.",
        "guidance": "The organization should enforce strict controls over the allocation and use of privileged access rights. This includes granting elevated permissions only to authorized personnel based on business needs, implementing multi-factor authentication (MFA), monitoring privileged activity, and conducting regular access reviews. Privileged accounts should be managed using the principle of least privilege (PoLP) and subject to logging and auditing to detect unauthorized or suspicious activity."
      },
      {
        "ref_code": "A.8.3",
        "name": "Information Access Restriction",
        "description": "Access to information and other associated assets shall be restricted in accordance with the established topic-specific policy on access control.",
        "guidance": "The organization should implement access controls to restrict access to information and associated assets based on its topic-specific access control policy. This includes enforcing role-based access, multi-factor authentication (MFA), least privilege principles, and regular access reviews. Access permissions should be continuously monitored, logged, and updated as necessary to prevent unauthorized access and ensure compliance with security policies."
      },
      {
        "ref_code": "A.8.4",
        "name": "Access to Source Code",
        "description": "Read and write access to source code, development tools and software libraries shall be appropriately managed.",
        "guidance": "The organization should enforce strict controls over read and write access to source code, development tools, and software libraries. Access should be granted based on the principle of least privilege (PoLP), using role-based access controls (RBAC) and multi-factor authentication (MFA) where applicable. Change management processes, logging, and version control should be implemented to monitor modifications and prevent unauthorized access or tampering. Regular access reviews and audits should be conducted to ensure compliance with security policies."
      },
      {
        "ref_code": "A.8.5",
        "name": "Secure Authentication",
        "description": "Secure authentication technologies and procedures shall be implemented based on information access restrictions and the topic-specific policy on access control.",
        "guidance": "The organization should implement secure authentication technologies and procedures that align with information access restrictions and the topic-specific access control policy. This includes using multi-factor authentication (MFA), strong password policies, biometric authentication, and cryptographic methods where necessary. Authentication mechanisms should be regularly reviewed and updated to address emerging threats and ensure compliance with security best practices."
      },
      {
        "ref_code": "A.8.6",
        "name": "Capacity Management",
        "description": "The use of resources shall be monitored and adjusted in line with current and expected capacity requirements.",
        "guidance": "The organization should continuously monitor the usage of resources, including computing power, storage, and network capacity, to ensure optimal performance and security. Capacity planning should be conducted based on current and projected requirements, with adjustments made as needed to prevent performance issues or resource shortages. Automated monitoring tools and alerts should be used to detect and address potential capacity constraints proactively."
      },
      {
        "ref_code": "A.8.7",
        "name": "Protection Against Malware",
        "description": "Protection against malware shall be implemented and supported by appropriate user awareness.",
        "guidance": "The organization should implement technical and administrative controls to protect against malware, including endpoint protection, intrusion detection systems, and regular security updates. User awareness training should be conducted to educate personnel on recognizing phishing attempts, avoiding suspicious downloads, and following safe browsing practices. Regular malware scans and incident response procedures should be in place to detect, mitigate, and respond to threats effectively."
      },
      {
        "ref_code": "A.8.8",
        "name": "Management of Technical Vulnerabilities",
        "description": "Information about technical vulnerabilities of information systems in use shall be obtained, the organization's exposure to such vulnerabilities shall be evaluated and appropriate measures shall be taken.",
        "guidance": "The organization should establish a vulnerability management process to continuously identify, assess, and mitigate technical vulnerabilities in its information systems. This includes obtaining threat intelligence from trusted sources, conducting regular vulnerability scans and penetration testing, and prioritizing remediation based on risk impact. Patching schedules, compensating controls, and continuous monitoring should be implemented to reduce the organization's exposure to security threats."
      },
      {
        "ref_code": "A.8.9",
        "name": "Configuration Management",
        "description": "Configurations, including security configurations, of hardware, software, services and networks shall be established, documented, implemented, monitored and reviewed.",
        "guidance": "The organization should establish and maintain documented security configurations for hardware, software, services, and networks. These configurations should follow industry best practices and security standards, ensuring systems are hardened against threats. Regular monitoring, audits, and reviews should be conducted to detect and remediate deviations, unauthorized changes, or vulnerabilities. Configuration baselines should be updated as needed to align with evolving security requirements."
      },
      {
        "ref_code": "A.8.10",
        "name": "Information Deletion",
        "description": "Information stored in information systems, devices or in any other storage media shall be deleted when no longer required.",
        "guidance": "The organization should implement secure data deletion procedures to ensure that information stored in systems, devices, or any other storage media is permanently removed when no longer required. This includes using secure deletion methods such as cryptographic erasure, data wiping tools, or physical destruction for sensitive data. Policies should define retention periods, and regular audits should be conducted to ensure compliance with data protection and regulatory requirements."
      },
      {
        "ref_code": "A.8.11",
        "name": "Data Masking",
        "description": "Data masking shall be used in accordance with the organization's topic-specific policy on access control and other related topic-specific policies, and business requirements, taking applicable legislation into consideration.",
        "guidance": "The organization should implement data masking techniques to protect sensitive information in accordance with its access control policy, business requirements, and applicable legal regulations. Data masking should be applied to production, testing, and development environments where necessary, ensuring that only authorized users can access the original data. Regular reviews should be conducted to verify the effectiveness of masking controls and ensure compliance with security and privacy requirements."
      },
      {
        "ref_code": "A.8.12",
        "name": "Data Leakage Prevention",
        "description": "Data leakage prevention measures shall be applied to systems, networks and any other devices that process, store or transmit sensitive information.",
        "guidance": "The organization should implement data leakage prevention (DLP) measures across systems, networks, and devices that process, store, or transmit sensitive information. This includes deploying DLP solutions to monitor and control data transfers, enforcing encryption, applying access controls, and restricting the use of removable media. Regular audits and monitoring should be conducted to detect and prevent unauthorized data exfiltration or leakage."
      },
      {
        "ref_code": "A.8.13",
        "name": "Information Backup",
        "description": "Backup copies of information, software and systems shall be maintained and regularly tested in accordance with the agreed topic-specific policy on backup.",
        "guidance": "The organization should establish and maintain a backup strategy that ensures critical information, software, and systems are regularly backed up and tested. Backups should be performed according to the organization's backup policy, with copies stored securely in multiple locations to prevent data loss. Regular testing of backup integrity and recovery procedures should be conducted to ensure data can be restored effectively in case of an incident."
      },
      {
        "ref_code": "A.8.14",
        "name": "Redundancy of Information Processing Facilities",
        "description": "Information processing facilities shall be implemented with redundancy sufficient to meet availability requirements.",
        "guidance": "The organization should implement redundancy measures for information processing facilities to ensure availability in case of system failures or disruptions. This includes deploying backup servers, failover systems, redundant network connections, and power supply solutions. Regular testing and monitoring should be conducted to verify the effectiveness of redundancy mechanisms and ensure continuous operations."
      },
      {
        "ref_code": "A.8.15",
        "name": "Logging",
        "description": "Logs that record activities, exceptions, faults and other relevant events shall be produced, stored, protected and analysed.",
        "guidance": "The organization should implement logging mechanisms to capture activities, exceptions, faults, and other relevant security events. Logs should be securely stored, protected from unauthorized access or tampering, and retained according to compliance requirements. Regular log analysis should be conducted to detect anomalies, investigate incidents, and improve security monitoring and response capabilities."
      },
      {
        "ref_code": "A.8.16",
        "name": "Monitoring Activities",
        "description": "Networks, systems and applications shall be monitored for anomalous behaviour and appropriate actions taken to evaluate potential information security incidents.",
        "guidance": "The organization should implement continuous monitoring of networks, systems, and applications to detect anomalous behavior. Automated security tools such as intrusion detection systems (IDS), security information and event management (SIEM), and endpoint detection and response (EDR) should be used to identify potential threats. When anomalies are detected, appropriate actions should be taken to investigate, assess risks, and respond to potential security incidents effectively."
      },
      {
        "ref_code": "A.8.17",
        "name": "Clock Synchronization",
        "description": "The clocks of information processing systems used by the organization shall be synchronized to approved time sources.",
        "guidance": "The organization should ensure that the clocks of all information processing systems are synchronized with approved and reliable time sources, such as Network Time Protocol (NTP) servers. Proper time synchronization is essential for accurate logging, security event correlation, and compliance with regulatory requirements. Regular monitoring and validation should be conducted to prevent time drift and maintain consistency across systems."
      },
      {
        "ref_code": "A.8.18",
        "name": "Use of Privileged Utility Programs",
        "description": "The use of utility programs that can be capable of overriding system and application controls shall be restricted and tightly controlled.",
        "guidance": "The organization should implement strict controls over the use of utility programs that can override system and application controls. Access should be restricted to authorized personnel, monitored through logging, and reviewed regularly. Additional security measures such as multi-factor authentication (MFA), role-based access control (RBAC), and change management procedures should be enforced to prevent unauthorized use or exploitation."
      },
      {
        "ref_code": "A.8.19",
        "name": "Installation of Software on Operational Systems",
        "description": "Procedures and measures shall be implemented to securely manage software installation on operational systems.",
        "guidance": "The organization should establish and enforce procedures for securely managing software installation on operational systems. This includes restricting installation privileges to authorized personnel, verifying software integrity before deployment, and maintaining an approved software list. Change management processes, security patching, and regular audits should be conducted to prevent unauthorized or vulnerable software from being installed."
      },
      {
        "ref_code": "A.8.20",
        "name": "Networks Security",
        "description": "Networks and network devices shall be secured, managed and controlled to protect information in systems and applications.",
        "guidance": "The organization should implement security controls to protect networks and network devices, ensuring the confidentiality, integrity, and availability of information. This includes enforcing access controls, using firewalls and intrusion detection/prevention systems, encrypting data in transit, and segmenting networks to minimize risks. Regular monitoring, vulnerability assessments, and updates should be conducted to maintain a secure network environment."
      },
      {
        "ref_code": "A.8.21",
        "name": "Security of Network Services",
        "description": "Security mechanisms, service levels and service requirements of network services shall be identified, implemented and monitored.",
        "guidance": "The organization should define and implement security mechanisms, service levels, and service requirements for network services. This includes specifying encryption standards, access controls, and traffic monitoring to ensure secure communication. Service levels should be documented in agreements, and regular monitoring and audits should be conducted to verify compliance with security and performance expectations."
      },
      {
        "ref_code": "A.8.22",
        "name": "Segregation of Networks",
        "description": "Groups of information services, users and information systems shall be segregated in the organization's networks.",
        "guidance": "The organization should implement network segregation to separate groups of information services, users, and systems based on security requirements and business needs. This includes using VLANs, firewalls, and access control policies to limit communication between segments, reducing the risk of unauthorized access or lateral movement of threats. Regular assessments should be conducted to ensure effective segregation and compliance with security policies."
      },
      {
        "ref_code": "A.8.23",
        "name": "Web Filtering",
        "description": "Access to external websites shall be managed to reduce exposure to malicious content.",
        "guidance": "The organization should implement controls to manage access to external websites, reducing the risk of exposure to malicious content. This includes using web filtering solutions, blocking known harmful sites, enforcing safe browsing policies, and monitoring web traffic for suspicious activity. Employees should receive training on secure browsing practices, and access policies should be regularly reviewed and updated based on emerging threats."
      },
      {
        "ref_code": "A.8.24",
        "name": "Use of Cryptography",
        "description": "Rules for the effective use of cryptography, including cryptographic key management, shall be defined and implemented.",
        "guidance": "The organization should establish and enforce rules for the effective use of cryptography, including cryptographic key management. This includes defining encryption standards, key generation, storage, rotation, and disposal procedures to protect sensitive data. Access to cryptographic keys should be restricted to authorized personnel, and regular audits should be conducted to ensure compliance with security policies and regulatory requirements."
      },
      {
        "ref_code": "A.8.25",
        "name": "Secure Development Life Cycle",
        "description": "Rules for the secure development of software and systems shall be established and applied.",
        "guidance": "The organization should define and enforce secure development rules for software and systems to mitigate security risks. This includes incorporating security requirements into the development lifecycle, conducting code reviews, applying secure coding practices, and performing regular security testing. Developers should be trained in secure coding techniques, and adherence to these rules should be monitored through audits and assessments."
      },
      {
        "ref_code": "A.8.26",
        "name": "Application Security Requirements",
        "description": "Information security requirements shall be identified, specified and approved when developing or acquiring applications.",
        "guidance": "The organization should establish a process to identify, specify, and approve information security requirements when developing or acquiring applications. This includes defining security controls, compliance requirements, data protection measures, and access controls based on risk assessments. Security requirements should be integrated into procurement and development processes, with regular reviews to ensure alignment with organizational policies and industry best practices."
      },
      {
        "ref_code": "A.8.27",
        "name": "Secure System Architecture and Engineering Principles",
        "description": "Principles for engineering secure systems shall be established, documented, maintained and applied to any information system development activities.",
        "guidance": "The organization should define, document, and maintain secure engineering principles to be applied in all information system development activities. These principles should cover areas such as secure design, threat modeling, access controls, encryption, and secure coding practices. Compliance with these principles should be ensured through regular security assessments, code reviews, and security testing throughout the system development lifecycle."
      },
      {
        "ref_code": "A.8.28",
        "name": "Secure Coding",
        "description": "Secure coding principles shall be applied to software development.",
        "guidance": "The organization should enforce secure coding principles throughout the software development lifecycle to prevent vulnerabilities and security risks. Developers should follow industry best practices, such as input validation, secure authentication, proper error handling, and protection against common threats like SQL injection and cross-site scripting (XSS). Regular security training, code reviews, and automated security testing should be conducted to ensure compliance with secure coding standards."
      },
      {
        "ref_code": "A.8.29",
        "name": "Security Testing in Development and Acceptance",
        "description": "Security testing processes shall be defined and implemented in the development life cycle.",
        "guidance": "The organization should establish and implement security testing processes as part of the software development lifecycle. This includes conducting static and dynamic code analysis, penetration testing, vulnerability assessments, and secure configuration reviews. Security testing should be performed at various stages of development to identify and remediate vulnerabilities before deployment. Regular updates to testing methodologies should be made to align with emerging threats and best practices."
      },
      {
        "ref_code": "A.8.30",
        "name": "Outsourced Development",
        "description": "The organization shall direct, monitor and review the activities related to outsourced system development.",
        "guidance": "The organization should establish controls to oversee outsourced system development, ensuring security requirements are met. This includes defining security expectations in contracts, conducting regular security assessments, and monitoring vendor activities throughout the development lifecycle. Regular reviews and audits should be performed to verify compliance with security policies and industry best practices."
      },
      {
        "ref_code": "A.8.31",
        "name": "Separation of Development, Test and Production Environments",
        "description": "Development, testing and production environments shall be separated and secured.",
        "guidance": "The organization should enforce strict separation between development, testing, and production environments to prevent unauthorized access and data leaks. Access controls should be implemented to restrict user privileges based on role and environment. Secure configurations, monitoring, and logging should be applied to each environment, and production data should not be used in development or testing environments unless properly sanitized. Regular audits should be conducted to ensure compliance with security policies."
      },
      {
        "ref_code": "A.8.32",
        "name": "Change Management",
        "description": "Changes to information processing facilities and information systems shall be subject to change management procedures.",
        "guidance": "The organization should implement a formal change management process for information processing facilities and information systems. All changes should be documented, assessed for security and operational impact, tested before deployment, and approved by authorized personnel. Change logs should be maintained, and rollback plans should be in place to minimize risks associated with failed or unauthorized modifications. Regular reviews and audits should be conducted to ensure compliance with change management policies."
      },
      {
        "ref_code": "A.8.33",
        "name": "Test Information",
        "description": "Test information shall be appropriately selected, protected and managed.",
        "guidance": "The organization should establish controls to ensure that test information is carefully selected, securely managed, and protected from unauthorized access or misuse. If production data is used for testing, it should be anonymized or masked to prevent exposure of sensitive information. Access to test data should be restricted based on role and necessity, and security measures such as encryption and logging should be implemented to maintain confidentiality and integrity."
      },
      {
        "ref_code": "A.8.34",
        "name": "Protection of Information Systems During Audit Testing",
        "description": "Audit tests and other assurance activities involving assessment of operational systems shall be planned and agreed between the tester and appropriate management.",
        "guidance": "The organization should ensure that audit tests and assurance activities involving operational systems are planned and formally approved by appropriate management. This includes defining the scope, objectives, and methodologies in advance to minimize disruptions. Security controls should be in place to protect sensitive data during audits, and findings should be documented, reviewed, and addressed as part of continuous improvement efforts."
      }
    ]
  }
]