[
  {
    "name": "Organization chart showing ownership percentages, and a schedule or chart of all affiliated entities.",
    "description": "Organization chart showing ownership percentages, and a schedule or chart of all affiliated entities.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_1",
    "subcontrols": [
      {
        "name": "A copy of the Adviser's organization chart showing ownership percentages of the Adviser and control persons, and a schedule or chart of all affiliated entities. Include all entities that are commonly controlled by, or under common control with, the Adviser.",
        "description": "A copy of the Adviser's organization chart showing ownership percentages of the Adviser and control persons, and a schedule or chart of all affiliated entities. Include all entities that are commonly controlled by, or under common control with, the Adviser.",
        "ref_code": "sec_1.a",
        "guidance": "A copy of the Adviser's organization chart showing ownership percentages of the Adviser and control persons, and a schedule or chart of all affiliated entities. Include all entities that are commonly controlled by, or under common control with, the Adviser. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "List of office locations.",
    "description": "List of office locations.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_2",
    "subcontrols": [
      {
        "name": "List of all office locations, including the Adviser's principal office and place of business ('Main Office') and any other locations from which the Adviser routinely conducts investment advisory services ('Branch Offices'). For each location, provide the address, date office opened, and number of employees and investment adviser representatives ('IARs') at the location.",
        "description": "List of all office locations, including the Adviser's principal office and place of business ('Main Office') and any other locations from which the Adviser routinely conducts investment advisory services ('Branch Offices'). For each location, provide the address, date office opened, and number of employees and investment adviser representatives ('IARs') at the location.",
        "ref_code": "sec_2.a",
        "guidance": "List of all office locations, including the Adviser's principal office and place of business ('Main Office') and any other locations from which the Adviser routinely conducts investment advisory services ('Branch Offices'). For each location, provide the address, date office opened, and number of employees and investment adviser representatives ('IARs') at the location. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Documentation supporting the organization's IT and Cybersecurity governance.",
    "description": "Documentation supporting the organization's IT and Cybersecurity governance.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_3",
    "subcontrols": [
      {
        "name": "Organizational charts that illustrate the positions and departments responsible for cybersecurity-related matters and where these individuals and departments fit within the Adviser's organization or hierarchy.",
        "description": "Organizational charts that illustrate the positions and departments responsible for cybersecurity-related matters and where these individuals and departments fit within the Adviser's organization or hierarchy.",
        "ref_code": "sec_3.a",
        "guidance": "Organizational charts that illustrate the positions and departments responsible for cybersecurity-related matters and where these individuals and departments fit within the Adviser's organization or hierarchy. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      },
      {
        "name": "Documentation supporting the firm's Information Technology Governance, including:  - Committee structures  - Lines of communication  - Reporting mechanism and frequency",
        "description": "Documentation supporting the firm's Information Technology Governance, including:  - Committee structures  - Lines of communication  - Reporting mechanism and frequency",
        "ref_code": "sec_3.b",
        "guidance": "Documentation supporting the firm's Information Technology Governance, including:  - Committee structures  - Lines of communication  - Reporting mechanism and frequency is a key safeguard for managing cybersecurity risks. Enable comprehensive logging and real-time monitoring across systems. Ensure logs are stored securely and reviewed regularly for signs of anomalous or unauthorized activity."
      }
    ]
  },
  {
    "name": "Additional documentation supporting the organization's IT and Cybersecurity governance.",
    "description": "Additional documentation supporting the organization's IT and Cybersecurity governance.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_4",
    "subcontrols": [
      {
        "name": "Identify the Chief Information Security Officer or equivalent position. If the role does not exist, explain where the principal responsibility for overseeing cybersecurity resides within the Adviser.",
        "description": "Identify the Chief Information Security Officer or equivalent position. If the role does not exist, explain where the principal responsibility for overseeing cybersecurity resides within the Adviser.",
        "ref_code": "sec_4.a",
        "guidance": "Identify the Chief Information Security Officer or equivalent position. If the role does not exist, explain where the principal responsibility for overseeing cybersecurity resides within the Adviser. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing network and application authentication.",
    "description": "Policies and procedures addressing network and application authentication.",
    "category": "Authentication",
    "subcategory": "Authentication",
    "ref_code": "sec_5",
    "subcontrols": [
      {
        "name": "Policies and procedures addressing network and application authentication, including any configuration requirements, password requirements, lockout threshold, password retention, etc.",
        "description": "Policies and procedures addressing network and application authentication, including any configuration requirements, password requirements, lockout threshold, password retention, etc.",
        "ref_code": "sec_5.a",
        "guidance": "Policies and procedures addressing network and application authentication, including any configuration requirements, password requirements, lockout threshold, password retention, etc. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing the protection of NPI and financial assets.",
    "description": "Policies and procedures addressing the protection of NPI and financial assets.",
    "category": "Funds Transfer and NPI Access Control",
    "subcategory": "Funds Transfer and NPI Access Control",
    "ref_code": "sec_6",
    "subcontrols": [
      {
        "name": "Policies and procedures describing how client Nonpublic Personal Information (\"NPI\") and financial assets are protected in the event that client accounts are compromised or accessed by a bad actor",
        "description": "Policies and procedures describing how client Nonpublic Personal Information (\"NPI\") and financial assets are protected in the event that client accounts are compromised or accessed by a bad actor",
        "ref_code": "sec_6.a",
        "guidance": "Policies and procedures describing how client Nonpublic Personal Information (\"NPI\") and financial assets are protected in the event that client accounts are compromised or accessed by a bad actor is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Privacy policy.",
    "description": "Privacy policy.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_7",
    "subcontrols": [
      {
        "name": "A copy of the Adviser's privacy policy provided to clients during the Examination Period.",
        "description": "A copy of the Adviser's privacy policy provided to clients during the Examination Period.",
        "ref_code": "sec_7.a",
        "guidance": "A copy of the Adviser's privacy policy provided to clients during the Examination Period. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Documenting non-compliance with cybersecurity policies.",
    "description": "Documenting non-compliance with cybersecurity policies.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_8",
    "subcontrols": [
      {
        "name": "A record of any non-compliance with the Adviser's cybersecurity policies and procedures during the Examination Period and any action taken as a result of such non-compliance.",
        "description": "A record of any non-compliance with the Adviser's cybersecurity policies and procedures during the Examination Period and any action taken as a result of such non-compliance.",
        "ref_code": "sec_8.a",
        "guidance": "A record of any non-compliance with the Adviser's cybersecurity policies and procedures during the Examination Period and any action taken as a result of such non-compliance. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      },
      {
        "name": "Reports covering compliance/noncompliance with authentication policies and procedures for the review period.  Any reporting of non-compliance with the password management policies and procedures, including any reporting submitted to governance forums.",
        "description": "Reports covering compliance/noncompliance with authentication policies and procedures for the review period.  Any reporting of non-compliance with the password management policies and procedures, including any reporting submitted to governance forums.",
        "ref_code": "sec_8.b",
        "guidance": "Reports covering compliance/noncompliance with authentication policies and procedures for the review period.  Any reporting of non-compliance with the password management policies and procedures, including any reporting submitted to governance forums. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Documentation of customer complaints.",
    "description": "Documentation of customer complaints.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_9",
    "subcontrols": [
      {
        "name": "A record of any client / investor complaints during the Examination Period involving cybersecurity or privacy. Please include a brief description of the resolution of the complaints and any remediation efforts undertaken in response.",
        "description": "A record of any client / investor complaints during the Examination Period involving cybersecurity or privacy. Please include a brief description of the resolution of the complaints and any remediation efforts undertaken in response.",
        "ref_code": "sec_9.a",
        "guidance": "A record of any client / investor complaints during the Examination Period involving cybersecurity or privacy. Please include a brief description of the resolution of the complaints and any remediation efforts undertaken in response. is a key safeguard for managing cybersecurity risks. Establish a formal incident response plan, including roles, responsibilities, and escalation paths. Conduct regular tabletop exercises and simulations to validate readiness."
      }
    ]
  },
  {
    "name": "Documentation of risk assessment process.",
    "description": "Documentation of risk assessment process.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_10",
    "subcontrols": [
      {
        "name": "A copy of the Adviser's most recent assessment of its cybersecurity risks.",
        "description": "A copy of the Adviser's most recent assessment of its cybersecurity risks.",
        "ref_code": "sec_10.a",
        "guidance": "A copy of the Adviser's most recent assessment of its cybersecurity risks. is a key safeguard for managing cybersecurity risks. Use risk assessments to identify, analyze, and prioritize cybersecurity threats. Implement controls based on likelihood and impact, and reassess regularly as conditions evolve."
      },
      {
        "name": "The latest risk assessment reporting (including action plans for all identified risk items) related to credential stuffing and business email compromise.",
        "description": "The latest risk assessment reporting (including action plans for all identified risk items) related to credential stuffing and business email compromise.",
        "ref_code": "sec_10.b",
        "guidance": "The latest risk assessment reporting (including action plans for all identified risk items) related to credential stuffing and business email compromise. is a key safeguard for managing cybersecurity risks. Use risk assessments to identify, analyze, and prioritize cybersecurity threats. Implement controls based on likelihood and impact, and reassess regularly as conditions evolve."
      }
    ]
  },
  {
    "name": "Reports related to testing and review of compliance towards cybersecurity policies.",
    "description": "Reports related to testing and review of compliance towards cybersecurity policies.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_11",
    "subcontrols": [
      {
        "name": "Any annual or interim reports or other documents regarding the review or testing of the Adviser's compliance with its cybersecurity policies and procedures, including those policies related to penetration testing, vulnerability scanning, and patch management.",
        "description": "Any annual or interim reports or other documents regarding the review or testing of the Adviser's compliance with its cybersecurity policies and procedures, including those policies related to penetration testing, vulnerability scanning, and patch management.",
        "ref_code": "sec_11.a",
        "guidance": "Any annual or interim reports or other documents regarding the review or testing of the Adviser's compliance with its cybersecurity policies and procedures, including those policies related to penetration testing, vulnerability scanning, and patch management. is a key safeguard for managing cybersecurity risks. Use automated tools to scan for vulnerabilities on a regular schedule. Prioritize patching based on severity and potential exposure, and verify remediation effectiveness."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing client authentication methods prior to fund transfers.",
    "description": "Policies and procedures addressing client authentication methods prior to fund transfers.",
    "category": "Funds Transfer and NPI Access Control",
    "subcategory": "Funds Transfer and NPI Access Control",
    "ref_code": "sec_12",
    "subcontrols": [
      {
        "name": "Provide a copy of the Adviser's policies and procedures related to verification of the authenticity of a client request to transfer funds. If no such written policies or procedures exist, please describe the process the Adviser follows to verify the authenticity of fund transfer requests and describe the individuals and/or departments involved in the authentication process.",
        "description": "Provide a copy of the Adviser's policies and procedures related to verification of the authenticity of a client request to transfer funds. If no such written policies or procedures exist, please describe the process the Adviser follows to verify the authenticity of fund transfer requests and describe the individuals and/or departments involved in the authentication process.",
        "ref_code": "sec_12.a",
        "guidance": "Provide a copy of the Adviser's policies and procedures related to verification of the authenticity of a client request to transfer funds. If no such written policies or procedures exist, please describe the process the Adviser follows to verify the authenticity of fund transfer requests and describe the individuals and/or departments involved in the authentication process. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      },
      {
        "name": "Policies and procedures describing how client Nonpublic Personal Information (\"NPI\") and financial assets are protected in the event that client accounts are compromised or accessed by a bad actor.",
        "description": "Policies and procedures describing how client Nonpublic Personal Information (\"NPI\") and financial assets are protected in the event that client accounts are compromised or accessed by a bad actor.",
        "ref_code": "sec_12.b",
        "guidance": "Policies and procedures describing how client Nonpublic Personal Information (\"NPI\") and financial assets are protected in the event that client accounts are compromised or accessed by a bad actor. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Regulation S-ID policy, if applicable.",
    "description": "Regulation S-ID policy, if applicable.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_13",
    "subcontrols": [
      {
        "name": "Provide a copy of the Adviser's Regulation S-ID policy. If the Adviser is not subject to Regulation S-ID, please state so.",
        "description": "Provide a copy of the Adviser's Regulation S-ID policy. If the Adviser is not subject to Regulation S-ID, please state so.",
        "ref_code": "sec_13.a",
        "guidance": "Provide a copy of the Adviser's Regulation S-ID policy. If the Adviser is not subject to Regulation S-ID, please state so. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      },
      {
        "name": "Documentation showing whether the firm offers or maintains \"covered accounts\" as defined in Rule 201 of Regulation S-ID. If the firm does not maintain covered accounts, provide the most recent risk assessment in which it determined that it does not maintain covered accounts.",
        "description": "Documentation showing whether the firm offers or maintains \"covered accounts\" as defined in Rule 201 of Regulation S-ID. If the firm does not maintain covered accounts, provide the most recent risk assessment in which it determined that it does not maintain covered accounts.",
        "ref_code": "sec_13.b",
        "guidance": "Documentation showing whether the firm offers or maintains \"covered accounts\" as defined in Rule 201 of Regulation S-ID. If the firm does not maintain covered accounts, provide the most recent risk assessment in which it determined that it does not maintain covered accounts. is a key safeguard for managing cybersecurity risks. Use risk assessments to identify, analyze, and prioritize cybersecurity threats. Implement controls based on likelihood and impact, and reassess regularly as conditions evolve."
      }
    ]
  },
  {
    "name": "Cybersecurity insurance policy.",
    "description": "Cybersecurity insurance policy.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_14",
    "subcontrols": [
      {
        "name": "Provide the Adviser's insurance policy that covers losses and expenses attributable to cybersecurity incidents, if any.",
        "description": "Provide the Adviser's insurance policy that covers losses and expenses attributable to cybersecurity incidents, if any.",
        "ref_code": "sec_14.a",
        "guidance": "Provide the Adviser's insurance policy that covers losses and expenses attributable to cybersecurity incidents, if any. is a key safeguard for managing cybersecurity risks. Establish a formal incident response plan, including roles, responsibilities, and escalation paths. Conduct regular tabletop exercises and simulations to validate readiness."
      }
    ]
  },
  {
    "name": "Board of director minutes and briefing reports.",
    "description": "Board of director minutes and briefing reports.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_15",
    "subcontrols": [
      {
        "name": "Provide a copy of all minutes and briefing material provided to the Adviser's board of directors (or senior management if the Adviser does not have a board of directors) regarding cybersecurity, including any testing of the Adviser's cybersecurity program, actual cybersecurity incidents, assessment of cybersecurity risks, and changes to its client privacy policy or cybersecurity program and policies and procedures",
        "description": "Provide a copy of all minutes and briefing material provided to the Adviser's board of directors (or senior management if the Adviser does not have a board of directors) regarding cybersecurity, including any testing of the Adviser's cybersecurity program, actual cybersecurity incidents, assessment of cybersecurity risks, and changes to its client privacy policy or cybersecurity program and policies and procedures",
        "ref_code": "sec_15.a",
        "guidance": "Provide a copy of all minutes and briefing material provided to the Adviser's board of directors (or senior management if the Adviser does not have a board of directors) regarding cybersecurity, including any testing of the Adviser's cybersecurity program, actual cybersecurity incidents, assessment of cybersecurity risks, and changes to its client privacy policy or cybersecurity program and policies and procedures is a key safeguard for managing cybersecurity risks. Establish a formal incident response plan, including roles, responsibilities, and escalation paths. Conduct regular tabletop exercises and simulations to validate readiness."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing cybersecurity awareness and training.",
    "description": "Policies and procedures addressing cybersecurity awareness and training.",
    "category": "Governance of Cybersecurity Programs",
    "subcategory": "Governance of Cybersecurity Programs",
    "ref_code": "sec_16",
    "subcontrols": [
      {
        "name": "Provide a copy of the Adviser's cybersecurity training policies and procedures.",
        "description": "Provide a copy of the Adviser's cybersecurity training policies and procedures.",
        "ref_code": "sec_16.a",
        "guidance": "Provide a copy of the Adviser's cybersecurity training policies and procedures. is a key safeguard for managing cybersecurity risks. Deliver targeted security training based on user roles and current threats. Reinforce learning through phishing simulations, awareness campaigns, and policy sign-offs."
      },
      {
        "name": "Policies and procedures around security awareness and training.",
        "description": "Policies and procedures around security awareness and training.",
        "ref_code": "sec_16.b",
        "guidance": "Policies and procedures around security awareness and training. is a key safeguard for managing cybersecurity risks. Deliver targeted security training based on user roles and current threats. Reinforce learning through phishing simulations, awareness campaigns, and policy sign-offs."
      }
    ]
  },
  {
    "name": "Documentation on systems and tools used to provent/detect/monitor client NPI data loss.",
    "description": "Documentation on systems and tools used to provent/detect/monitor client NPI data loss.",
    "category": "Data Loss Prevention",
    "subcategory": "Data Loss Prevention",
    "ref_code": "sec_17",
    "subcontrols": [
      {
        "name": "Provide a list of the systems, utilities, and tools used to prevent, detect, and monitor data loss as it relates to client NPI. Please include a brief description of their functions and whether the systems are proprietary, managed by a third party, or commercial off-the-shelf products.",
        "description": "Provide a list of the systems, utilities, and tools used to prevent, detect, and monitor data loss as it relates to client NPI. Please include a brief description of their functions and whether the systems are proprietary, managed by a third party, or commercial off-the-shelf products.",
        "ref_code": "sec_17.a",
        "guidance": "Provide a list of the systems, utilities, and tools used to prevent, detect, and monitor data loss as it relates to client NPI. Please include a brief description of their functions and whether the systems are proprietary, managed by a third party, or commercial off-the-shelf products. is a key safeguard for managing cybersecurity risks. Enable comprehensive logging and real-time monitoring across systems. Ensure logs are stored securely and reviewed regularly for signs of anomalous or unauthorized activity."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing monitoring exfiltration and unauthorized distribution of client NPI.",
    "description": "Policies and procedures addressing monitoring exfiltration and unauthorized distribution of client NPI.",
    "category": "Data Loss Prevention",
    "subcategory": "Data Loss Prevention",
    "ref_code": "sec_18",
    "subcontrols": [
      {
        "name": "Provide a copy of the Adviser's policies and procedures relating to monitoring exfiltration and unauthorized distribution of client NPI outside of the Adviser through email, physical media, hard copy, web-based file transfer programs, or via other electronic means. If the Adviser maintains documentation of this monitoring, please include a copy of the most recent report.",
        "description": "Provide a copy of the Adviser's policies and procedures relating to monitoring exfiltration and unauthorized distribution of client NPI outside of the Adviser through email, physical media, hard copy, web-based file transfer programs, or via other electronic means. If the Adviser maintains documentation of this monitoring, please include a copy of the most recent report.",
        "ref_code": "sec_18.a",
        "guidance": "Provide a copy of the Adviser's policies and procedures relating to monitoring exfiltration and unauthorized distribution of client NPI outside of the Adviser through email, physical media, hard copy, web-based file transfer programs, or via other electronic means. If the Adviser maintains documentation of this monitoring, please include a copy of the most recent report. is a key safeguard for managing cybersecurity risks. Enable comprehensive logging and real-time monitoring across systems. Ensure logs are stored securely and reviewed regularly for signs of anomalous or unauthorized activity."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing protection of network resources and devices.",
    "description": "Policies and procedures addressing protection of network resources and devices.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_19",
    "subcontrols": [
      {
        "name": "Policies and procedures that address ensuring that unauthorized persons do not access its network resources and devices",
        "description": "Policies and procedures that address ensuring that unauthorized persons do not access its network resources and devices",
        "ref_code": "sec_19.a",
        "guidance": "Policies and procedures that address ensuring that unauthorized persons do not access its network resources and devices is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Policies and procedures on updating access rights.",
    "description": "Policies and procedures on updating access rights.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_20",
    "subcontrols": [
      {
        "name": "Policies and procedures that address updating access rights based on personnel or system changes (i.e., obtaining authorization to add, delete, or modify authorized user access to systems or applications)",
        "description": "Policies and procedures that address updating access rights based on personnel or system changes (i.e., obtaining authorization to add, delete, or modify authorized user access to systems or applications)",
        "ref_code": "sec_20.a",
        "guidance": "Policies and procedures that address updating access rights based on personnel or system changes (i.e., obtaining authorization to add, delete, or modify authorized user access to systems or applications) is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Additioinal policies and procedures on updating access rights.",
    "description": "Additioinal policies and procedures on updating access rights.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_21",
    "subcontrols": [
      {
        "name": "Policies and procedures that address obtaining manager approval of changes to access rights or controls",
        "description": "Policies and procedures that address obtaining manager approval of changes to access rights or controls",
        "ref_code": "sec_21.a",
        "guidance": "Policies and procedures that address obtaining manager approval of changes to access rights or controls is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "New employee list.",
    "description": "New employee list.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_22",
    "subcontrols": [
      {
        "name": "Provide a list of the last ten employees or IARs who were hired by the Adviser during the Examination Period, including: employee name; title; hire date; start date; date access rights granted; documentation evidencing manager approval.",
        "description": "Provide a list of the last ten employees or IARs who were hired by the Adviser during the Examination Period, including: employee name; title; hire date; start date; date access rights granted; documentation evidencing manager approval.",
        "ref_code": "sec_22.a",
        "guidance": "Provide a list of the last ten employees or IARs who were hired by the Adviser during the Examination Period, including: employee name; title; hire date; start date; date access rights granted; documentation evidencing manager approval. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Terminated employee list.",
    "description": "Terminated employee list.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_23",
    "subcontrols": [
      {
        "name": "A list of the last ten employees or IARs to leave the Adviser during the Examination Period and documentation evidencing their last date of employment and the date their access to the Adviser's network and systems was terminated",
        "description": "A list of the last ten employees or IARs to leave the Adviser during the Examination Period and documentation evidencing their last date of employment and the date their access to the Adviser's network and systems was terminated",
        "ref_code": "sec_23.a",
        "guidance": "A list of the last ten employees or IARs to leave the Adviser during the Examination Period and documentation evidencing their last date of employment and the date their access to the Adviser's network and systems was terminated is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Reassigned employee list.",
    "description": "Reassigned employee list.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_24",
    "subcontrols": [
      {
        "name": "A list of the last ten employees or IARs to be reassigned by the Adviser to a new group or function during the Examination Period and documentation evidencing the date of employee's reassignment; manager approval of change in access rights including date manager approved change; the date employee's access to the adviser's systems and applications was modified.",
        "description": "A list of the last ten employees or IARs to be reassigned by the Adviser to a new group or function during the Examination Period and documentation evidencing the date of employee's reassignment; manager approval of change in access rights including date manager approved change; the date employee's access to the adviser's systems and applications was modified.",
        "ref_code": "sec_24.a",
        "guidance": "A list of the last ten employees or IARs to be reassigned by the Adviser to a new group or function during the Examination Period and documentation evidencing the date of employee's reassignment; manager approval of change in access rights including date manager approved change; the date employee's access to the adviser's systems and applications was modified. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Documentation on access rights reviews.",
    "description": "Documentation on access rights reviews.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_25",
    "subcontrols": [
      {
        "name": "If the Adviser conducts reviews of user (i.e., employee, IAR, contractor/vendor, other third parties) access rights and restrictions with respect to role or job-specific resources within the network, provide a list of reviews conducted during the Examination Period and a brief description of each. If the Adviser maintains documentation related to these reviews, provide a copy of the most recent report for each type of review.",
        "description": "If the Adviser conducts reviews of user (i.e., employee, IAR, contractor/vendor, other third parties) access rights and restrictions with respect to role or job-specific resources within the network, provide a list of reviews conducted during the Examination Period and a brief description of each. If the Adviser maintains documentation related to these reviews, provide a copy of the most recent report for each type of review.",
        "ref_code": "sec_25.a",
        "guidance": "If the Adviser conducts reviews of user (i.e., employee, IAR, contractor/vendor, other third parties) access rights and restrictions with respect to role or job-specific resources within the network, provide a list of reviews conducted during the Examination Period and a brief description of each. If the Adviser maintains documentation related to these reviews, provide a copy of the most recent report for each type of review. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Additional documentation on access rights reviews.",
    "description": "Additional documentation on access rights reviews.",
    "category": "Access Rights and Controls",
    "subcategory": "Access Rights and Controls",
    "ref_code": "sec_26",
    "subcontrols": [
      {
        "name": "Provide a list of any instances during the Examination Period where system users (including employees, IARs, clients, contractors/vendors, and any other third parties) received entitlements or access to the Adviser's network, data, systems, or reports in contravention of 8 the Adviser's policies or practices and without authorization. Please include the date and a brief description of the instance and any remediation efforts undertaken in response.",
        "description": "Provide a list of any instances during the Examination Period where system users (including employees, IARs, clients, contractors/vendors, and any other third parties) received entitlements or access to the Adviser's network, data, systems, or reports in contravention of 8 the Adviser's policies or practices and without authorization. Please include the date and a brief description of the instance and any remediation efforts undertaken in response.",
        "ref_code": "sec_26.a",
        "guidance": "Provide a list of any instances during the Examination Period where system users (including employees, IARs, clients, contractors/vendors, and any other third parties) received entitlements or access to the Adviser's network, data, systems, or reports in contravention of 8 the Adviser's policies or practices and without authorization. Please include the date and a brief description of the instance and any remediation efforts undertaken in response. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Vendor inventory.",
    "description": "Vendor inventory.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_27",
    "subcontrols": [
      {
        "name": "Provide a list of all vendors with access to adviser's network, systems, or data. Indicate whether the vendor is a web or cloud based service provider or a cybersecurity-related vendor.",
        "description": "Provide a list of all vendors with access to adviser's network, systems, or data. Indicate whether the vendor is a web or cloud based service provider or a cybersecurity-related vendor.",
        "ref_code": "sec_27.a",
        "guidance": "Provide a list of all vendors with access to adviser's network, systems, or data. Indicate whether the vendor is a web or cloud based service provider or a cybersecurity-related vendor. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Vendor contract example.",
    "description": "Vendor contract example.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_28",
    "subcontrols": [
      {
        "name": "Provide a sample contract that illustrates the typical contractual terms related to Vendors' access to the Adviser's networks, systems, or data, including client NPI.",
        "description": "Provide a sample contract that illustrates the typical contractual terms related to Vendors' access to the Adviser's networks, systems, or data, including client NPI.",
        "ref_code": "sec_28.a",
        "guidance": "Provide a sample contract that illustrates the typical contractual terms related to Vendors' access to the Adviser's networks, systems, or data, including client NPI. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Additional vendor inventory documentation.",
    "description": "Additional vendor inventory documentation.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_29",
    "subcontrols": [
      {
        "name": "Provide a list of all vendors that are cloud based, regardless of whether these Vendors have access to the Adviser's network.",
        "description": "Provide a list of all vendors that are cloud based, regardless of whether these Vendors have access to the Adviser's network.",
        "ref_code": "sec_29.a",
        "guidance": "Provide a list of all vendors that are cloud based, regardless of whether these Vendors have access to the Adviser's network. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Additional vendor inventory documentation.",
    "description": "Additional vendor inventory documentation.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_30",
    "subcontrols": [
      {
        "name": "Provide a list of all vendors That provide cybersecurity services, regardless of whether these Vendors have direct access to the firms network. Please include Dark Web monitoring services in this list.",
        "description": "Provide a list of all vendors That provide cybersecurity services, regardless of whether these Vendors have direct access to the firms network. Please include Dark Web monitoring services in this list.",
        "ref_code": "sec_30.a",
        "guidance": "Provide a list of all vendors That provide cybersecurity services, regardless of whether these Vendors have direct access to the firms network. Please include Dark Web monitoring services in this list. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Additional vendor inventory documentation.",
    "description": "Additional vendor inventory documentation.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_31",
    "subcontrols": [
      {
        "name": "For each Vendor listed, please include a brief description of the service (or type of service) the Vendor provides to the Adviser, whether the Adviser has access to client NPI, and whether the Adviser has an executed contract in place with the Vendor.",
        "description": "For each Vendor listed, please include a brief description of the service (or type of service) the Vendor provides to the Adviser, whether the Adviser has access to client NPI, and whether the Adviser has an executed contract in place with the Vendor.",
        "ref_code": "sec_31.a",
        "guidance": "For each Vendor listed, please include a brief description of the service (or type of service) the Vendor provides to the Adviser, whether the Adviser has access to client NPI, and whether the Adviser has an executed contract in place with the Vendor. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Vendor contingency plan.",
    "description": "Vendor contingency plan.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_32",
    "subcontrols": [
      {
        "name": "Provide a copy of any written contingency plans the Adviser has with its Vendors in case of bankruptcy, the development of conflicts of interest, or other issues that might put the Vendor out of business. If not documented, please describe any such contingency plans (e.g., software escrow).",
        "description": "Provide a copy of any written contingency plans the Adviser has with its Vendors in case of bankruptcy, the development of conflicts of interest, or other issues that might put the Vendor out of business. If not documented, please describe any such contingency plans (e.g., software escrow).",
        "ref_code": "sec_32.a",
        "guidance": "Provide a copy of any written contingency plans the Adviser has with its Vendors in case of bankruptcy, the development of conflicts of interest, or other issues that might put the Vendor out of business. If not documented, please describe any such contingency plans (e.g., software escrow). is a key safeguard for managing cybersecurity risks. Assess third-party risk by requiring security attestations and contractual obligations. Monitor vendor performance and restrict access to sensitive systems as needed."
      }
    ]
  },
  {
    "name": "Documentation relation to requirements from vendors prior to significant changes.",
    "description": "Documentation relation to requirements from vendors prior to significant changes.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_33",
    "subcontrols": [
      {
        "name": "Provide a sample of documentation or notification that the Adviser requires (or has received) from third-party Vendors to provide prior to any significant changes to the third-party Vendors' systems, components, or services that could potentially have security impacts to the Adviser and its data containing NPI.",
        "description": "Provide a sample of documentation or notification that the Adviser requires (or has received) from third-party Vendors to provide prior to any significant changes to the third-party Vendors' systems, components, or services that could potentially have security impacts to the Adviser and its data containing NPI.",
        "ref_code": "sec_33.a",
        "guidance": "Provide a sample of documentation or notification that the Adviser requires (or has received) from third-party Vendors to provide prior to any significant changes to the third-party Vendors' systems, components, or services that could potentially have security impacts to the Adviser and its data containing NPI. is a key safeguard for managing cybersecurity risks. Assess third-party risk by requiring security attestations and contractual obligations. Monitor vendor performance and restrict access to sensitive systems as needed."
      }
    ]
  },
  {
    "name": "Additional vendor inventory documentation.",
    "description": "Additional vendor inventory documentation.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_34",
    "subcontrols": [
      {
        "name": "Provide a list of terminated Vendors during the Examination Period.",
        "description": "Provide a list of terminated Vendors during the Examination Period.",
        "ref_code": "sec_34.a",
        "guidance": "Provide a list of terminated Vendors during the Examination Period. is a key safeguard for managing cybersecurity risks. Assess third-party risk by requiring security attestations and contractual obligations. Monitor vendor performance and restrict access to sensitive systems as needed."
      }
    ]
  },
  {
    "name": "Documentation of actual or suspected breaches involving vendors.",
    "description": "Documentation of actual or suspected breaches involving vendors.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_35",
    "subcontrols": [
      {
        "name": "Provide information obtained by the Adviser regarding any actual or suspected breaches of the vendor's data security protocols, including: date of suspected breach, summary of facts surrounding the breach, how the vendor discovered the issue, steps taken to address risk, whether senior management at the Advisor and vendor was apprised of the issue, and whether any other stakeholders (additional vendor clients with interconnected systems) were made aware of the breach.",
        "description": "Provide information obtained by the Adviser regarding any actual or suspected breaches of the vendor's data security protocols, including: date of suspected breach, summary of facts surrounding the breach, how the vendor discovered the issue, steps taken to address risk, whether senior management at the Advisor and vendor was apprised of the issue, and whether any other stakeholders (additional vendor clients with interconnected systems) were made aware of the breach.",
        "ref_code": "sec_35.a",
        "guidance": "Provide information obtained by the Adviser regarding any actual or suspected breaches of the vendor's data security protocols, including: date of suspected breach, summary of facts surrounding the breach, how the vendor discovered the issue, steps taken to address risk, whether senior management at the Advisor and vendor was apprised of the issue, and whether any other stakeholders (additional vendor clients with interconnected systems) were made aware of the breach. is a key safeguard for managing cybersecurity risks. Use risk assessments to identify, analyze, and prioritize cybersecurity threats. Implement controls based on likelihood and impact, and reassess regularly as conditions evolve."
      }
    ]
  },
  {
    "name": "Documentation of communication relating to actual or suspected breaches involving vendors.",
    "description": "Documentation of communication relating to actual or suspected breaches involving vendors.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_36",
    "subcontrols": [
      {
        "name": "Provide a copy of any internal communications with vendors (e-mails, letters) concerning any suspected/actual breaches.",
        "description": "Provide a copy of any internal communications with vendors (e-mails, letters) concerning any suspected/actual breaches.",
        "ref_code": "sec_36.a",
        "guidance": "Provide a copy of any internal communications with vendors (e-mails, letters) concerning any suspected/actual breaches. is a key safeguard for managing cybersecurity risks. Assess third-party risk by requiring security attestations and contractual obligations. Monitor vendor performance and restrict access to sensitive systems as needed."
      }
    ]
  },
  {
    "name": "Documentation of actual or suspected internal breaches relating to video conferencing software.",
    "description": "Documentation of actual or suspected internal breaches relating to video conferencing software.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_37",
    "subcontrols": [
      {
        "name": "Provide information on any actual or suspected breaches of the firm's data security protocols related to the use of video conferencing software, including: date of the actual or suspected breach, summary of facts surrounding breach, how the firm discovered the issue, steps taken to address the risk, whether senior management at the firm was apprised of the issue, and whether any other stakeholders (clients, vendors) were made aware of the breach.",
        "description": "Provide information on any actual or suspected breaches of the firm's data security protocols related to the use of video conferencing software, including: date of the actual or suspected breach, summary of facts surrounding breach, how the firm discovered the issue, steps taken to address the risk, whether senior management at the firm was apprised of the issue, and whether any other stakeholders (clients, vendors) were made aware of the breach.",
        "ref_code": "sec_37.a",
        "guidance": "Provide information on any actual or suspected breaches of the firm's data security protocols related to the use of video conferencing software, including: date of the actual or suspected breach, summary of facts surrounding breach, how the firm discovered the issue, steps taken to address the risk, whether senior management at the firm was apprised of the issue, and whether any other stakeholders (clients, vendors) were made aware of the breach. is a key safeguard for managing cybersecurity risks. Use risk assessments to identify, analyze, and prioritize cybersecurity threats. Implement controls based on likelihood and impact, and reassess regularly as conditions evolve."
      }
    ]
  },
  {
    "name": "Documentation of internal communication with clients or stakeholders (emails/letters) relating to actual or suspected internal breaches.",
    "description": "Documentation of internal communication with clients or stakeholders (emails/letters) relating to actual or suspected internal breaches.",
    "category": "Vendor Management",
    "subcategory": "Vendor Management",
    "ref_code": "sec_38",
    "subcontrols": [
      {
        "name": "Provide a copy of any internal communications with clients or other stakeholders (e-mails, letters) concerning any suspected/actual breaches.",
        "description": "Provide a copy of any internal communications with clients or other stakeholders (e-mails, letters) concerning any suspected/actual breaches.",
        "ref_code": "sec_38.a",
        "guidance": "Provide a copy of any internal communications with clients or other stakeholders (e-mails, letters) concerning any suspected/actual breaches. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Policies and procedures relating to tabletop exercises.",
    "description": "Policies and procedures relating to tabletop exercises.",
    "category": "Incident Response Management",
    "subcategory": "Incident Response Management",
    "ref_code": "sec_39",
    "subcontrols": [
      {
        "name": "Provide a copy of the Adviser's policies and procedures for conducting tests or exercises of its incident response plan, including the frequency of such testing, if applicable.",
        "description": "Provide a copy of the Adviser's policies and procedures for conducting tests or exercises of its incident response plan, including the frequency of such testing, if applicable.",
        "ref_code": "sec_39.a",
        "guidance": "Provide a copy of the Adviser's policies and procedures for conducting tests or exercises of its incident response plan, including the frequency of such testing, if applicable. is a key safeguard for managing cybersecurity risks. Establish a formal incident response plan, including roles, responsibilities, and escalation paths. Conduct regular tabletop exercises and simulations to validate readiness."
      }
    ]
  },
  {
    "name": "Documentation of tabletop exercises that have taken place.",
    "description": "Documentation of tabletop exercises that have taken place.",
    "category": "Incident Response Management",
    "subcategory": "Incident Response Management",
    "ref_code": "sec_40",
    "subcontrols": [
      {
        "name": "If the Adviser prepares a report related to testing of its incident response plan, please provide a copy of the most recent report.",
        "description": "If the Adviser prepares a report related to testing of its incident response plan, please provide a copy of the most recent report.",
        "ref_code": "sec_40.a",
        "guidance": "If the Adviser prepares a report related to testing of its incident response plan, please provide a copy of the most recent report. is a key safeguard for managing cybersecurity risks. Establish a formal incident response plan, including roles, responsibilities, and escalation paths. Conduct regular tabletop exercises and simulations to validate readiness."
      }
    ]
  },
  {
    "name": "Documentation of cybersecurity incidents or breaches.",
    "description": "Documentation of cybersecurity incidents or breaches.",
    "category": "Incident Response Management",
    "subcategory": "Incident Response Management",
    "ref_code": "sec_41",
    "subcontrols": [
      {
        "name": "Provide a list of all cybersecurity incidents or breaches that occurred during the Examination Period.",
        "description": "Provide a list of all cybersecurity incidents or breaches that occurred during the Examination Period.",
        "ref_code": "sec_41.a",
        "guidance": "Provide a list of all cybersecurity incidents or breaches that occurred during the Examination Period. is a key safeguard for managing cybersecurity risks. Establish a formal incident response plan, including roles, responsibilities, and escalation paths. Conduct regular tabletop exercises and simulations to validate readiness."
      },
      {
        "name": "List of incidents for the review period (full documentation, including root cause analysis, guidance efforts, etc.) related to account compromise.",
        "description": "List of incidents for the review period (full documentation, including root cause analysis, guidance efforts, etc.) related to account compromise.",
        "ref_code": "sec_41.b",
        "guidance": "List of incidents for the review period (full documentation, including root cause analysis, guidance efforts, etc.) related to account compromise. is a key safeguard for managing cybersecurity risks. Establish a formal incident response plan, including roles, responsibilities, and escalation paths. Conduct regular tabletop exercises and simulations to validate readiness."
      }
    ]
  },
  {
    "name": "Identity Theft Provention Program.",
    "description": "Identity Theft Provention Program.",
    "category": "Firm Overview",
    "subcategory": "Firm Overview",
    "ref_code": "sec_42",
    "subcontrols": [
      {
        "name": "Identity Theft Prevention Program, including all policies and procedures incorporated into the firm's Identity Theft Prevention Program.",
        "description": "Identity Theft Prevention Program, including all policies and procedures incorporated into the firm's Identity Theft Prevention Program.",
        "ref_code": "sec_42.a",
        "guidance": "Identity Theft Prevention Program, including all policies and procedures incorporated into the firm's Identity Theft Prevention Program. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Documentation covering the number of customer relationships.",
    "description": "Documentation covering the number of customer relationships.",
    "category": "Firm Overview",
    "subcategory": "Firm Overview",
    "ref_code": "sec_43",
    "subcontrols": [
      {
        "name": "Approximate number of \"customer relationships\" the firm maintains as defined under Rule 30 of Regulation S-P.",
        "description": "Approximate number of \"customer relationships\" the firm maintains as defined under Rule 30 of Regulation S-P.",
        "ref_code": "sec_43.a",
        "guidance": "Approximate number of \"customer relationships\" the firm maintains as defined under Rule 30 of Regulation S-P. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing IP blocking, geolocations, and device fingerprinting.",
    "description": "Policies and procedures addressing IP blocking, geolocations, and device fingerprinting.",
    "category": "Authentication",
    "subcategory": "Authentication",
    "ref_code": "sec_44",
    "subcontrols": [
      {
        "name": "Policies and procedures that may address IP block-listing/blocking after a certain number of failed logins, use of geolocations, device fingerprinting, as users attempt to access systems.",
        "description": "Policies and procedures that may address IP block-listing/blocking after a certain number of failed logins, use of geolocations, device fingerprinting, as users attempt to access systems.",
        "ref_code": "sec_44.a",
        "guidance": "Policies and procedures that may address IP block-listing/blocking after a certain number of failed logins, use of geolocations, device fingerprinting, as users attempt to access systems. is a key safeguard for managing cybersecurity risks. Implement strict access controls, including role-based access and multi-factor authentication. Regularly review permissions to minimize unnecessary access and reduce the risk of insider threats."
      }
    ]
  },
  {
    "name": "Policies and procedures addressing credential stuffing and email compromise.",
    "description": "Policies and procedures addressing credential stuffing and email compromise.",
    "category": "Monitoring and Alerting",
    "subcategory": "Monitoring and Alerting",
    "ref_code": "sec_45",
    "subcontrols": [
      {
        "name": "Policies and procedures around detecting, monitoring, alerting, reporting and preventing of unusual or suspicious behavior on the network to protect against credential stuffing and business email compromise.",
        "description": "Policies and procedures around detecting, monitoring, alerting, reporting and preventing of unusual or suspicious behavior on the network to protect against credential stuffing and business email compromise.",
        "ref_code": "sec_45.a",
        "guidance": "Policies and procedures around detecting, monitoring, alerting, reporting and preventing of unusual or suspicious behavior on the network to protect against credential stuffing and business email compromise. is a key safeguard for managing cybersecurity risks. Enable comprehensive logging and real-time monitoring across systems. Ensure logs are stored securely and reviewed regularly for signs of anomalous or unauthorized activity."
      }
    ]
  },
  {
    "name": "Reports on network monitoring.",
    "description": "Reports on network monitoring.",
    "category": "Monitoring and Alerting",
    "subcategory": "Monitoring and Alerting",
    "ref_code": "sec_46",
    "subcontrols": [
      {
        "name": "Reporting (such as operational reports or from governance materials) indicating that the network is being monitored for:  - Cyber breaches whereby employees' or clients' credentials are stolen  - Frequency of the cyber-attacks against a particular asset",
        "description": "Reporting (such as operational reports or from governance materials) indicating that the network is being monitored for:  - Cyber breaches whereby employees' or clients' credentials are stolen  - Frequency of the cyber-attacks against a particular asset",
        "ref_code": "sec_46.a",
        "guidance": "Reporting (such as operational reports or from governance materials) indicating that the network is being monitored for:  - Cyber breaches whereby employees' or clients' credentials are stolen  - Frequency of the cyber-attacks against a particular asset is a key safeguard for managing cybersecurity risks. Enable comprehensive logging and real-time monitoring across systems. Ensure logs are stored securely and reviewed regularly for signs of anomalous or unauthorized activity."
      }
    ]
  },
  {
    "name": "Examples of suspicious activity alerts.",
    "description": "Examples of suspicious activity alerts.",
    "category": "Monitoring and Alerting",
    "subcategory": "Monitoring and Alerting",
    "ref_code": "sec_47",
    "subcontrols": [
      {
        "name": "Examples of any alerts sent to users notifying them of detected suspicious activity on their accounts.",
        "description": "Examples of any alerts sent to users notifying them of detected suspicious activity on their accounts.",
        "ref_code": "sec_47.a",
        "guidance": "Examples of any alerts sent to users notifying them of detected suspicious activity on their accounts. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Anti-spam policies and procedures.",
    "description": "Anti-spam policies and procedures.",
    "category": "Email security",
    "subcategory": "Email security",
    "ref_code": "sec_48",
    "subcontrols": [
      {
        "name": "Policies and procedures for configuration and implementation of the firm's anti-spam solution, including evidence of an anti spam solution having been deployed in production environment.",
        "description": "Policies and procedures for configuration and implementation of the firm's anti-spam solution, including evidence of an anti spam solution having been deployed in production environment.",
        "ref_code": "sec_48.a",
        "guidance": "Policies and procedures for configuration and implementation of the firm's anti-spam solution, including evidence of an anti spam solution having been deployed in production environment. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "ERM framework documentation.",
    "description": "ERM framework documentation.",
    "category": "Second and Third Lines of Defense",
    "subcategory": "Second and Third Lines of Defense",
    "ref_code": "sec_49",
    "subcontrols": [
      {
        "name": "Enterprise Risk Management framework or its equivalent.",
        "description": "Enterprise Risk Management framework or its equivalent.",
        "ref_code": "sec_49.a",
        "guidance": "Enterprise Risk Management framework or its equivalent. is a key safeguard for managing cybersecurity risks. Use risk assessments to identify, analyze, and prioritize cybersecurity threats. Implement controls based on likelihood and impact, and reassess regularly as conditions evolve."
      }
    ]
  },
  {
    "name": "Technology risk assessment documentation.",
    "description": "Technology risk assessment documentation.",
    "category": "Second and Third Lines of Defense",
    "subcategory": "Second and Third Lines of Defense",
    "ref_code": "sec_50",
    "subcontrols": [
      {
        "name": "The current technology risk assessment schedule/plan or its equivalent.",
        "description": "The current technology risk assessment schedule/plan or its equivalent.",
        "ref_code": "sec_50.a",
        "guidance": "The current technology risk assessment schedule/plan or its equivalent. is a key safeguard for managing cybersecurity risks. Enable comprehensive logging and real-time monitoring across systems. Ensure logs are stored securely and reviewed regularly for signs of anomalous or unauthorized activity."
      }
    ]
  },
  {
    "name": "Documentation of risk relating to credential stuffing and email compromise.",
    "description": "Documentation of risk relating to credential stuffing and email compromise.",
    "category": "Second and Third Lines of Defense",
    "subcategory": "Second and Third Lines of Defense",
    "ref_code": "sec_51",
    "subcontrols": [
      {
        "name": "The current risk registry entries related to business email compromise and credential stuffing.",
        "description": "The current risk registry entries related to business email compromise and credential stuffing.",
        "ref_code": "sec_51.a",
        "guidance": "The current risk registry entries related to business email compromise and credential stuffing. is a key safeguard for managing cybersecurity risks. Use risk assessments to identify, analyze, and prioritize cybersecurity threats. Implement controls based on likelihood and impact, and reassess regularly as conditions evolve."
      }
    ]
  },
  {
    "name": "Technology audit plan.",
    "description": "Technology audit plan.",
    "category": "Second and Third Lines of Defense",
    "subcategory": "Second and Third Lines of Defense",
    "ref_code": "sec_52",
    "subcontrols": [
      {
        "name": "The current technology audit plan and audit universe.",
        "description": "The current technology audit plan and audit universe.",
        "ref_code": "sec_52.a",
        "guidance": "The current technology audit plan and audit universe. is a key safeguard for managing cybersecurity risks. Enable comprehensive logging and real-time monitoring across systems. Ensure logs are stored securely and reviewed regularly for signs of anomalous or unauthorized activity."
      }
    ]
  },
  {
    "name": "Internal audit reports relating to credential stuffing and email compromise.",
    "description": "Internal audit reports relating to credential stuffing and email compromise.",
    "category": "Second and Third Lines of Defense",
    "subcategory": "Second and Third Lines of Defense",
    "ref_code": "sec_53",
    "subcontrols": [
      {
        "name": "The latest Internal Audit reports related to credential stuffing and business email compromise.",
        "description": "The latest Internal Audit reports related to credential stuffing and business email compromise.",
        "ref_code": "sec_53.a",
        "guidance": "The latest Internal Audit reports related to credential stuffing and business email compromise. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  },
  {
    "name": "Additional audit reports relating to credential stuffing and email compromise.",
    "description": "Additional audit reports relating to credential stuffing and email compromise.",
    "category": "Second and Third Lines of Defense",
    "subcategory": "Second and Third Lines of Defense",
    "ref_code": "sec_54",
    "subcontrols": [
      {
        "name": "The current listing of all outstanding Internal Audit findings related to business email compromise and credential stuffing.",
        "description": "The current listing of all outstanding Internal Audit findings related to business email compromise and credential stuffing.",
        "ref_code": "sec_54.a",
        "guidance": "The current listing of all outstanding Internal Audit findings related to business email compromise and credential stuffing. is a key safeguard for managing cybersecurity risks. Apply best practices for secure architecture, detection, and response. Ensure controls are tested and improved through continuous evaluation and refinement."
      }
    ]
  }
]